{
    "tt": 0,
    "it": [
        {
            "creator": "David Shore",
            "title": "House M.D.",
            "nos": 8,
            "year": "2004-2012",
            "rating": "TV-14",
            "imdb": "8.7",
            "rt": 0,
            "awards": "Won 5 Primetime Emmys. 57 wins & 140 nominations total",
            "desc": "An antisocial maverick doctor who specializes in diagnostic medicine does whatever it takes to solve puzzling cases that come his way using his crack team of doctors and his wits.",
            "stars": "Hugh Laurie, Omar Epps, Robert Sean Leonard",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": null,
                    "episode_count": 5,
                    "id": 3682,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/8ab1NGlnXmcyT2Jkpy2QDwYMQCR.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2004-11-16",
                    "episode_count": 22,
                    "id": 3674,
                    "name": "Season 1",
                    "overview": "Dr. Gregory House is devoid of bedside manner  and wouldn't even talk to his patients if he could get away with it.  Dealing with his own constant physical pain, he uses a cane that seems  to punctuate his acerbic, brutally honest demeanor. While his behavior  can border on antisocial, House is a maverick physician whose  unconventional thinking and flawless instincts have afforded him a great  deal of respect. House's roster of medical cases are the inexplicable  ones other doctors can't solve, and he has assembled an elite team of  young medical experts to help him in his effort to solve these  diagnostic mysteries.",
                    "poster_path": "/lXBIhFheyDRA72vRQvYF1mkEF27.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2005-09-13",
                    "episode_count": 24,
                    "id": 3675,
                    "name": "Season 2",
                    "overview": "House will do whatever it takes to solve a  case before it's too late, from sending one of his team to break into a  patient's home in search of clues, to attempting a controversial,  trial-and-error form of treatment to see how a patient responds. House's  methods may be suspect, but his results are not — he saves lives no one  else can. Always in House's way is Dr. Lisa Cuddy, the Dean of Medicine  and hospital administrator — and ethical gatekeeper of the hospital who  is in constant conflict with House over his extreme treatments and  unconventional behavior. House's former love Stacy Warner recently  accepted a job as General Counsel to the hospital, and her presence  there has reignited feelings House thought were safely buried.",
                    "poster_path": "/j2LxTsMhXYqfi4k9Vome8kQc26U.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2006-09-05",
                    "episode_count": 24,
                    "id": 3679,
                    "name": "Season 3",
                    "overview": "In the Season 2 finale, House suffered  multiple gunshot wounds inflicted by a former patient's husband  determined to carry out retribution for House's treatment of his wife's  case. In a shocking surprise to his co-workers, House comes through the  ordeal with a slightly new perspective on his treatment of patients —  but will it affect how he makes medical decisions? And will it last?",
                    "poster_path": "/muuLevUfVbpq87lWljfZ8HLga6b.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2007-09-25",
                    "episode_count": 16,
                    "id": 3678,
                    "name": "Season 4",
                    "overview": "In the Season 3 finale, the set-in-his-ways House was confronted  with a series of major changes to his team — but any effects of this  “house-cleaning,\" or the changes it may bring to House professionally or  personally, remain to be seen...",
                    "poster_path": "/CryJFbwif5U1VViZ5EkmeomD3q.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2008-09-16",
                    "episode_count": 24,
                    "id": 3676,
                    "name": "Season 5",
                    "overview": "In the Season 4 finale, after a massive bus accident left House without  recollection of the accident, he and  the team put the pieces of his  memory together and discover Wilson’s girlfriend Amber was on the bus  with him and was fatally injured.  Wilson has to face the shocking  realization that House was involved in Amber’s death.\n\nAs Season 5  opens, with his friendship with Wilson shattered, House must determine  if he’s responsible for Amber’s death and Wilson must decide if House is  a destructive force in his life while Cuddy attempts to advance a  reconciliation between the two of them.",
                    "poster_path": "/bwE3QGVeC7E5VycnIPVzPtzpBId.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2009-09-21",
                    "episode_count": 22,
                    "id": 3677,
                    "name": "Season 6",
                    "overview": "When the previous season concluded, House was  forced to admit that he had lost his grip on reality and could no longer  practice medicine.  Out of options, he checked himself into a  psychiatric hospital. Season 6 will explore  House’s long and twisted road to recovery: Can he find some version of  sanity and normalcy? Can he stay away from the workplace that arguably  drove him to mental instability but is also the only stable foundation  in his life? Can Princeton-Plainsboro continue its celebrated Department  of Diagnostics without him? How will Cuddy’s relationship with House  change, now that their imagined affair is out in the open?",
                    "poster_path": "/hhcJGHhq2xMUCp2sGRrw523M7Zx.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2010-09-20",
                    "episode_count": 23,
                    "id": 3680,
                    "name": "Season 7",
                    "overview": "In the Season 6 finale, House, driven by the  loss of a patient he treated at an accident site and confronted with  the unexpected news that Cuddy was now engaged, spiraled into despair  and considered treating his mental and emotional anguish with Vicodin,  potentially prompting the cycle of his dependency and addiction all over  again. But in a surprising turn, Cuddy revealed that she called off her  engagement and admitted to House she loves him, despite wishing she  didn’t. Also, Thirteen submitted her leave of absence from the hospital,  prompting questions about the status of her health.  As Season 7 begins, House and Cuddy attempt to make a real  relationship work and face the question as to whether their new  relationship will affect their ability to diagnose patients.",
                    "poster_path": "/z0zkn4BME4M9ycaHldChWR3m7XL.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2011-10-03",
                    "episode_count": 22,
                    "id": 3681,
                    "name": "Season 8",
                    "overview": "Last season, House and Cuddy finally decided to take  their relationship to the next level, but struggled to find a balance  between their professional and personal lives, and ultimately, Cuddy  made the very emotional decision to end their relationship. As each of  them dealt with the aftermath of the break-up, House got married to an  immigrant in need of a Green Card. In the series' milestone 150th  episode, Thirteen was released from prison after euthanizing her brother  who was suffering from the late stages of Huntington's Disease, the  same disease with which she is afflicted.  As the season comes to a  close, when House's attempts to mend his relationship with Cuddy fall  short, he's compelled to take drastic and possibly irrevocable measures  that could forever change the course of their relationship.",
                    "poster_path": "/fqMpdjiGe4jejxTm1NAWnhRV6CM.jpg",
                    "season_number": 8
                }
            ],
            "genres": [
                "Drama",
                "Mystery"
            ],
            "poster": "/lkvhReTBZ2Ksl0Dl5Oplsf6UYkF.jpg"
        },
        {
            "creator": "Matt Duffer",
            "title": "Stranger Things",
            "nos": 4,
            "year": "2016-",
            "rating": "TV-14",
            "imdb": "8.7",
            "rt": 0,
            "awards": "Won 7 Primetime Emmys. 76 wins & 210 nominations total",
            "desc": "When a young boy disappears, his mother, a police chief and his friends must confront terrifying supernatural forces in order to get him back.",
            "stars": "Millie Bobby Brown, Finn Wolfhard, Winona Ryder",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2016-07-15",
                    "episode_count": 8,
                    "id": 77680,
                    "name": "Season 1",
                    "overview": "Strange things are afoot in Hawkins, Indiana, where a young boy's sudden disappearance unearths a young girl with otherworldly powers.",
                    "poster_path": "/zka9GTG4QQhLmN4NR18KEjxICtt.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2017-10-27",
                    "episode_count": 9,
                    "id": 83248,
                    "name": "Stranger Things 2",
                    "overview": "It's been nearly a year since Will's strange disappearance. But life's hardly back to normal in Hawkins. Not even close.",
                    "poster_path": "/lXS60geme1LlEob5Wgvj3KilClA.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2019-07-04",
                    "episode_count": 8,
                    "id": 115216,
                    "name": "Stranger Things 3",
                    "overview": "Budding romance. A brand-new mall. And rabid rats running toward danger. It's the summer of 1985 in Hawkins ... and one summer can change everything.",
                    "poster_path": "/x2LSRK2Cm7MZhjluni1msVJ3wDF.jpg",
                    "season_number": 3
                },
                {
                    "air_date": null,
                    "episode_count": 1,
                    "id": 163313,
                    "name": "Season 4",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 4
                }
            ],
            "genres": [
                "Drama",
                "Fantasy",
                "Horror"
            ],
            "poster": "/x2LSRK2Cm7MZhjluni1msVJ3wDF.jpg"
        },
        {
            "creator": "Kurt Sutter",
            "title": "Sons of Anarchy",
            "nos": 7,
            "year": "2008-2014",
            "rating": "TV-MA",
            "imdb": "8.5",
            "rt": 0,
            "awards": "Nominated for 5 Primetime Emmys. Another 11 wins & 51 nominations.",
            "desc": "A biker struggles to balance being a father and being involved in an outlaw motorcycle club.",
            "stars": "Charlie Hunnam, Katey Sagal, Mark Boone Junior, Kim Coates",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2011-09-01",
                    "episode_count": 14,
                    "id": 3683,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/yn029EQ54ZNoz8udq7EPzTb12YD.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2008-09-03",
                    "episode_count": 13,
                    "id": 3684,
                    "name": "Season 1",
                    "overview": "Led by Clay Morrow (Ron Perlman), the outlaw motorcycle club Sons of Anarchy exerts a Mafia-like hold over the small Northern Californian town of Charming.",
                    "poster_path": "/xKNhDgGmwCGEodcGXxV5oCC2ifO.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2009-09-08",
                    "episode_count": 13,
                    "id": 3685,
                    "name": "Season 2",
                    "overview": "This season Jax and the club deal with the fallout from Donna’s death, bringing internal tensions to an all-time high while a new enemy takes root in Charming. LAN, or League of American Nationalists, is a white separatist organization headed by Ethan Zobelle (Adam Arkin) with help from his lieutenant, A.J. Weston (Henry Rollins). Zobelle opens a cigar shop on Main Street intent on ingratiating himself with the community and forcing SAMCRO out.",
                    "poster_path": "/1kyH5qYL37qMiEWnQacvBT7rOOp.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2010-09-07",
                    "episode_count": 13,
                    "id": 3686,
                    "name": "Season 3",
                    "overview": "This season begins with SAMCRO feeling powerless over Abel’s kidnapping, especially Jax, whose grief sends him into deeper turmoil over his future with the club. The search for Abel sends our guys to Ireland, where Jax faces not only the Irish Republican Army but an untold personal history as well. Meanwhile, still on the lam, Gemma is hit with unexpected news and risks her freedom to deal with it.",
                    "poster_path": "/2gKXA3XDbJmhQIsym7YvDne5Xb6.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2011-09-06",
                    "episode_count": 14,
                    "id": 3687,
                    "name": "Season 4",
                    "overview": "This season begins with SAMCRO fresh out of jail and back into Charming. Upon their arrival, they encounter new law enforcement and head right back to business. The club is pressed with a decision that could challenge what SOA has always stood for and brings forth an unlikely alliance. Jax, fresh out of jail and dealing with the birth of his new-born son, is forced to put new plans into motion that could affect the club and ultimately his family. ",
                    "poster_path": "/wC74BLPmFVwCKsHU8O6m8d5QqVi.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2012-09-11",
                    "episode_count": 13,
                    "id": 3688,
                    "name": "Season 5",
                    "overview": "This season begins with Jax and Tara as the club’s new king and queen after learning the truth behind his father's death and facing the consequences of the club's illicit deeds. Stripped of his patch after Jax discovers he was complicit in John Teller’s death, Clay recovers from gunshot wounds that nearly killed him while Gemma is faced with a new life without the comfort of her family. With the threat of RICO still looming, Jax has to find a way to protect his family and save his club as SAMCRO is pulled into a conflict with a potent new enemy.",
                    "poster_path": "/sW67RSH740Ogrp6LGDCgpgGaK1u.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2013-09-10",
                    "episode_count": 13,
                    "id": 3689,
                    "name": "Season 6",
                    "overview": "Having framed Clay for the murder of Damon Pope, Season Six begins with Jax’s leadership uncontested, but his family life is suffering from his single-minded pursuit of John Teller’s vision. Jax must find a way to keep Tara from going to prison for conspiracy to commit murder while rebuilding his club and breaking from the cycle of violence and greed that ultimately led to his best friend’s death.",
                    "poster_path": "/4SoAEKCvxGT61GGw0AUE94g5NLm.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2014-09-09",
                    "episode_count": 13,
                    "id": 62180,
                    "name": "Season 7",
                    "overview": "The seventh and final season of Sons of Anarchy begins ten days after the tragic events of Season Six with Jax in jail on a parole violation, grappling with his inner demons. With the club’s full support, he sets in motion the brutal machinations that will lead to complete and merciless retribution.",
                    "poster_path": "/t0Nc2OaIwc6SDdfwG0kM4Jvaj5Q.jpg",
                    "season_number": 7
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Thriller"
            ],
            "poster": "/33fRHA8ToARmja6UiIkcINTU4d1.jpg"
        },
        {
            "creator": "Frank Darabont",
            "title": "The Walking Dead",
            "nos": 11,
            "year": "2010-2022",
            "rating": "TV-14",
            "imdb": "8.2",
            "rt": 0,
            "awards": "Won 2 Primetime Emmys. 78 wins & 222 nominations total",
            "desc": "Sheriff Deputy Rick Grimes wakes up from a coma to learn the world is in ruins and must lead a group of survivors to stay alive.",
            "stars": "Andrew Lincoln, Norman Reedus, Melissa McBride",
            "nextepi": {
                "air_date": "2021-08-22",
                "episode_number": 1,
                "id": 2853949,
                "name": "Acheron: Part I",
                "overview": "Returning to Alexandria from a critical food mission, the group realises it isn’t enough. Maggie proposes a new plan, potentially a suicide mission. What choice do they have? They must find more food for all their people in order to survive and efficiently rebuild Alexandria. If they don’t, Alexandria falls, taking them down with it.\n\nOnce on the road, a violent storm erupts forcing them underground into a subway tunnel. As nerves fray and suspicions increase, chaos ensues. The terror is relentless as our people get a glimpse of what Maggie and her group endured prior to returning to Alexandria. Meanwhile, those captured by the strange soldiers are relocated to another undisclosed location.",
                "production_code": "",
                "season_number": 11,
                "still_path": "/3z60K5pxrNjzyWNTGOELOcRJ30g.jpg",
                "vote_average": 0.0,
                "vote_count": 0
            },
            "seasons": [
                {
                    "air_date": "2010-10-11",
                    "episode_count": 47,
                    "id": 3646,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/mjUvUEzOwnMz6fx75RHGOqwmPnM.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2010-10-31",
                    "episode_count": 6,
                    "id": 3643,
                    "name": "Season 1",
                    "overview": "Rick Grimes embarks on a survivalist adventure in a post-zombie apocalypse Atlanta.",
                    "poster_path": "/yaOB2Y8GcoXwjNQ3apq67bMbNHF.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2011-10-16",
                    "episode_count": 13,
                    "id": 3644,
                    "name": "Season 2",
                    "overview": "Under Rick's leadership, the group leave Atlanta in search of sanctuary.",
                    "poster_path": "/wpG9SDyz23t3vU8dTbtSvEkxv8r.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2012-10-14",
                    "episode_count": 16,
                    "id": 3645,
                    "name": "Season 3",
                    "overview": "Having seemingly found a place of security, the group are faced with an unprecedented new threat.",
                    "poster_path": "/mDVPeQ5ZaaeO2Qh7VlXZchHHuLN.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2013-10-13",
                    "episode_count": 16,
                    "id": 3647,
                    "name": "Season 4",
                    "overview": "As the group settle into life in a stable shelter, a new danger threatens disaster.",
                    "poster_path": "/pLXlKKQOoUZAjWsXwacZCj6SWIb.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2014-10-12",
                    "episode_count": 16,
                    "id": 60391,
                    "name": "Season 5",
                    "overview": "After the season 4 finale left most of the main characters at the mercy of the sadistic inhabitants of Terminus. Season 5 will offer new directions for the group of survivors as scientist Eugene Porter promises a cure to the zombie virus if he can be safely escorted to Washington DC, but getting there is easier said than done.",
                    "poster_path": "/oiQbg5WqdHqBWMrtbzJeS6vb2Lt.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2015-10-11",
                    "episode_count": 16,
                    "id": 68814,
                    "name": "Season 6",
                    "overview": "Rick attempts to use his authority in Alexandria to keep the inhabitants safe, even as a new threat looms.",
                    "poster_path": "/kwVAeAA6TlZWr6lRP2yVTyR2aif.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2016-10-23",
                    "episode_count": 16,
                    "id": 76834,
                    "name": "Season 7",
                    "overview": "Rick and his group's world becomes even more brutal due to Negan's deadly example of what happens if they don't live under his rules. Everyone must begin again.",
                    "poster_path": "/fz6LidJF4Ue3gspFCKtxCERMCM4.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2017-10-22",
                    "episode_count": 16,
                    "id": 91735,
                    "name": "Season 8",
                    "overview": "Rick and his survivors bring \"All-Out War\" to Negan and his forces. The Saviors are larger, better-equipped, and ruthless - but Rick and the unified communities are fighting for the promise of a brighter future. The battle lines are drawn as they launch into a kinetic, action-packed offensive.",
                    "poster_path": "/wmv0oIun52Xeq65sBKfHiUkiBKc.jpg",
                    "season_number": 8
                },
                {
                    "air_date": "2018-10-07",
                    "episode_count": 16,
                    "id": 109531,
                    "name": "Season 9",
                    "overview": "With the defeat of Negan and the Saviors, the survivors are now rebuilding civilisation under Rick’s leadership. However, the group are forced to face their biggest threat yet as the walkers around them have started whispering.",
                    "poster_path": "/5KKovNGmh20sDBnyFyuaYTOSmh8.jpg",
                    "season_number": 9
                },
                {
                    "air_date": "2019-10-06",
                    "episode_count": 22,
                    "id": 123967,
                    "name": "Season 10",
                    "overview": "It is now Spring, a few months after the end of Season 9, when our group of survivors dared to cross into Whisperer territory during the harsh winter. The collected communities are still dealing with the after effects of Alpha’s horrific display of power, reluctantly respecting the new borderlines being imposed on them, all while organising themselves into a militia-style fighting force, preparing for a battle that may be unavoidable. But the Whisperers are a threat unlike any they have ever faced. Backed by a massive horde of the dead it is seemingly a fight they cannot win.",
                    "poster_path": "/rqeYMLryjcawh2JeRpCVUDXYM5b.jpg",
                    "season_number": 10
                },
                {
                    "air_date": "2021-08-22",
                    "episode_count": 8,
                    "id": 189337,
                    "name": "Season 11",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 11
                }
            ],
            "genres": [
                "Drama",
                "Horror",
                "Thriller"
            ],
            "poster": "/rqeYMLryjcawh2JeRpCVUDXYM5b.jpg"
        },
        {
            "creator": "Jenji Kohan",
            "title": "Orange Is the New Black",
            "nos": 7,
            "year": "2013-2019",
            "rating": "TV-MA",
            "imdb": "8.0",
            "rt": 0,
            "awards": "Won 4 Primetime Emmys. Another 48 wins & 143 nominations.",
            "desc": "Convicted of a decade old crime of transporting drug money to an ex-girlfriend, normally law-abiding Piper Chapman is sentenced to a year and a half behind bars to face the reality of how life-changing prison can really be.",
            "stars": "Taylor Schilling, Kate Mulgrew, Uzo Aduba, Danielle Brooks",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2016-04-27",
                    "episode_count": 1,
                    "id": 76666,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/ciBgjhGgKedIOaMgHJ8NsQVhcFd.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2013-07-11",
                    "episode_count": 13,
                    "id": 3765,
                    "name": "Season 1",
                    "overview": "Piper must trade her comfortable New York life for an orange prison jumpsuit when her decade-old relationship with a drug runner catches up with her.",
                    "poster_path": "/kJzjhNiMiDk7sqgrmbEAk56oR9D.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2014-06-06",
                    "episode_count": 13,
                    "id": 3766,
                    "name": "Season 2",
                    "overview": "Shocking revelations and new arrivals shake up the lives and relationships of Litchfield's prisoners.",
                    "poster_path": "/xekxbBb8sk6gyi0Xq3nNwqJFHX1.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2015-06-11",
                    "episode_count": 13,
                    "id": 65442,
                    "name": "Season 3",
                    "overview": "New business interests, spiritual movements and parental problems upend lives and ignite power struggles among Litchfield's residents and guards.",
                    "poster_path": "/6CVeQu1HCgolMRJ8Gr1iYwF5aIc.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2016-06-17",
                    "episode_count": 13,
                    "id": 73939,
                    "name": "Season 4",
                    "overview": "New faces and old resentments make for a potentially volatile blend, especially now that Litchfield is a for-profit business.",
                    "poster_path": "/r4kUNRIcBAPJJ3MSzTbyzbLNGBa.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2017-06-09",
                    "episode_count": 13,
                    "id": 84848,
                    "name": "Season 5",
                    "overview": "The power dynamics at Litchfield shift dramatically as the inmates react to a tragedy in an explosive new season.",
                    "poster_path": "/mv9FXJJZqRPv0lxKGBfXE3c3Eaq.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2018-07-27",
                    "episode_count": 13,
                    "id": 104790,
                    "name": "Season 6",
                    "overview": "",
                    "poster_path": "/aUJBd30FALs9qqvM8EkOiG8i8oP.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2019-07-26",
                    "episode_count": 13,
                    "id": 124604,
                    "name": "Season 7",
                    "overview": "",
                    "poster_path": "/k5dyiQ3CJ538WRiDA2dGkHua4vn.jpg",
                    "season_number": 7
                }
            ],
            "genres": [
                "Comedy",
                "Crime",
                "Drama"
            ],
            "poster": "/ekaa7YjGPTkFLcPhwWXTnARuCEU.jpg"
        },
        {
            "creator": "Peter Gould",
            "title": "Better Call Saul",
            "nos": 5,
            "year": "2015-",
            "rating": "TV-MA",
            "imdb": "8.8",
            "rt": 0,
            "awards": "Nominated for 39 Primetime Emmys. Another 35 wins & 166 nominations.",
            "desc": "The trials and tribulations of criminal lawyer Jimmy McGill in the time before he established his strip-mall law office in Albuquerque, New Mexico.",
            "stars": "Bob Odenkirk, Rhea Seehorn, Jonathan Banks, Patrick Fabian",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2014-12-18",
                    "episode_count": 19,
                    "id": 64929,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/oaF4Fj0FafTEK2CX9aiIW42oABe.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2015-02-08",
                    "episode_count": 10,
                    "id": 60223,
                    "name": "Season 1",
                    "overview": "When we meet him, the man who will become Saul Goodman is known as Jimmy McGill, a small-time lawyer searching for his destiny, and, more immediately, hustling to make ends meet. Working alongside, and often against, Jimmy is “fixer” Mike Erhmantraut.",
                    "poster_path": "/iwwHYFrVJF3mkHHMp77120gnYUq.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2016-02-15",
                    "episode_count": 10,
                    "id": 72040,
                    "name": "Season 2",
                    "overview": "Season one left Jimmy at the center of a large class-action lawsuit that led to a promising job opportunity at a prestigious firm in Santa Fe. Having arrived at a fork in the road, will Jimmy take the straight and narrow path with a safe corporate job or will he fall back into his “Slippin’ Jimmy” con artist ways?",
                    "poster_path": "/7othdOzr1RFJaIUuyhNlbWPLiA7.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2017-04-10",
                    "episode_count": 10,
                    "id": 83956,
                    "name": "Season 3",
                    "overview": "As the season three begins, the repercussions of Chuck's scheme test Jimmy and Kim's fledgling law practices -- and their romance -- as never before. This imminent existential threat presses Jimmy’s faltering moral compass to the limit. Meanwhile, Mike searches for a mysterious adversary who seems to know almost everything about his business.",
                    "poster_path": "/tVxi5KuJJAmAuDdSyZUPiURDPcV.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2018-08-06",
                    "episode_count": 10,
                    "id": 104603,
                    "name": "Season 4",
                    "overview": "In Season 4, in the wake of a loss, Jimmy takes steps into the criminal world that will put his future as a lawyer — and his relationship with Kim — in jeopardy.",
                    "poster_path": "/56YsRH5U0Yx0hklQX0V7aXNjRDn.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2020-02-23",
                    "episode_count": 10,
                    "id": 136162,
                    "name": "Season 5",
                    "overview": "Jimmy finally makes the decision that changes everything — to practice law as “Saul Goodman.” And this decision will soon create unexpected and profound waves of change for everyone in his world.",
                    "poster_path": "/mAgBQaGqoDUgCAmntKiqp61y1Ec.jpg",
                    "season_number": 5
                }
            ],
            "genres": [
                "Crime",
                "Drama"
            ],
            "poster": "/cU0kAjGjA6d2XjBzJMUIEVKiGDb.jpg"
        },
        {
            "creator": "Mark Gatiss",
            "title": "Sherlock",
            "nos": 4,
            "year": "2010-2017",
            "rating": "TV-14",
            "imdb": "9.1",
            "rt": 0,
            "awards": "Won 9 Primetime Emmys. Another 83 wins & 183 nominations.",
            "desc": "A modern update finds the famous sleuth and his doctor partner solving crime in 21st century London.",
            "stars": "Benedict Cumberbatch, Martin Freeman, Una Stubbs, Rupert Graves",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2010-07-24",
                    "episode_count": 9,
                    "id": 30120,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/zTlz1py47FtTrlaaV82cq5WQhXT.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2010-07-25",
                    "episode_count": 3,
                    "id": 30121,
                    "name": "Series 1",
                    "overview": "When a chance encounter brings soldier John Watson into Sherlock's life, it's apparent the two men couldn't be more different, but Sherlock's intellect coupled with John's pragmatism soon forges an unbreakable alliance as they investigate a series of baffling cases together.",
                    "poster_path": "/oNdH4gE2zYbUqNWMZ4pakRs9Mi5.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2012-01-01",
                    "episode_count": 3,
                    "id": 30122,
                    "name": "Series 2",
                    "overview": "A Royal scandal, a dazzling game of cat and mouse. The seductive Irene Adler is cold, calculating, brilliant. Has Sherlock finally met his match?",
                    "poster_path": "/axnRjDkP2qZfxG7iXILafYrDN3J.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2014-01-01",
                    "episode_count": 3,
                    "id": 30123,
                    "name": "Series 3",
                    "overview": "Sherlock is back, but will things ever be the same again?",
                    "poster_path": "/z9ljxwZUQA2349ZBZAssBXpd0i6.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2017-01-01",
                    "episode_count": 3,
                    "id": 62206,
                    "name": "Series 4",
                    "overview": "The fourth series begins with the nation’s favourite detective, the mercurial Sherlock Holmes, back once more on British soil, as Doctor Watson and his wife, Mary, prepare for their biggest ever challenge - becoming parents for the first time.",
                    "poster_path": "/yVaWUlLmln0xqUDxVFc8JBuzHzK.jpg",
                    "season_number": 4
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Mystery",
                "Thriller"
            ],
            "poster": "/7WTsnHkbA0FaG6R9twfFde0I9hl.jpg"
        },
        {
            "creator": "Greg Berlanti",
            "title": "You",
            "nos": 3,
            "year": "2018-",
            "rating": "TV-MA",
            "imdb": "7.7",
            "rt": 0,
            "awards": "2 wins & 5 nominations",
            "desc": "A dangerously charming, intensely obsessive young man goes to extreme measures to insert himself into the lives of those he is transfixed by.",
            "stars": "Penn Badgley, Victoria Pedretti, Ambyr Childers",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2018-09-09",
                    "episode_count": 10,
                    "id": 101109,
                    "name": "Season 1",
                    "overview": "",
                    "poster_path": "/2dHMsDZYGRRiALkGG8P7TJdYOAu.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2019-12-26",
                    "episode_count": 10,
                    "id": 127111,
                    "name": "Season 2",
                    "overview": "",
                    "poster_path": "/wZDUeDRbbFrMiTDVRy85Zdzgqcp.jpg",
                    "season_number": 2
                },
                {
                    "air_date": null,
                    "episode_count": 0,
                    "id": 176441,
                    "name": "Season 3",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 3
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Romance"
            ],
            "poster": "/9qZUrhcFVI9MNznVJxdfcrmifof.jpg"
        },
        {
            "creator": "Steven Knight",
            "title": "Peaky Blinders",
            "nos": 5,
            "year": "2013-",
            "rating": "TV-MA",
            "imdb": "8.8",
            "rt": 0,
            "awards": "20 wins & 47 nominations total",
            "desc": "A gangster family epic set in 1900s England, centering on a gang who sew razor blades in the peaks of their caps, and their fierce boss Tommy Shelby.",
            "stars": "Cillian Murphy, Paul Anderson, Helen McCrory",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": null,
                    "episode_count": 17,
                    "id": 178069,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/o5VrKdfN5Xg2pRnQVSqBCi4iNG9.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2013-09-12",
                    "episode_count": 6,
                    "id": 59914,
                    "name": "Series 1",
                    "overview": "",
                    "poster_path": "/yMvESLkgmtdAseh6LN97Ex92vvI.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2014-10-02",
                    "episode_count": 6,
                    "id": 62804,
                    "name": "Series 2",
                    "overview": "As the 1920s begin to roar, business is booming for the Peaky Blinders gang. Shelby sets his sights on wider horizons and his meteoric rise brings him into contact with both the upper echelons of society and astonishing new adversaries from London’s criminal world. All will test him to the core, though in very different ways. Meanwhile, Shelby’s home turf faces new challenges as an enemy from his past returns to the city with plans for a revenge of biblical proportions.",
                    "poster_path": "/8vp08uElPn5S2jHSVuAjrytJiuH.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2016-05-05",
                    "episode_count": 6,
                    "id": 72707,
                    "name": "Series 3",
                    "overview": "The action has moved on two years to 1924 and as Tommy starts married life he is more determined than ever to go legitimate and keep his family safe. But he finds himself pulled into a web of intrigue more lethal than anything he has yet encountered.",
                    "poster_path": "/qiKEvlPNZjo5jawyrHFAYyniUu4.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2017-11-15",
                    "episode_count": 6,
                    "id": 94653,
                    "name": "Series 4",
                    "overview": "It is 1924, Tommy Shelby is caught in a dangerous web of international intrigue.",
                    "poster_path": "/zBAPK0FY2MHuN6pvCQwO9kk16Ol.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2019-08-25",
                    "episode_count": 6,
                    "id": 129442,
                    "name": "Series 5",
                    "overview": "It is 1929, Tommy Shelby MP is approached by a charismatic politician with a bold vision for Britain, he realises that his response will affect not just his family’s future but that of the entire nation.",
                    "poster_path": "/arlFd2cGgP9kvEnL9FwXlcTm28D.jpg",
                    "season_number": 5
                }
            ],
            "genres": [
                "Crime",
                "Drama"
            ],
            "poster": "/6PX0r5TRRU5y0jZ70y1OtbLYmoD.jpg"
        },
        {
            "creator": "Michael Hirst",
            "title": "Vikings",
            "nos": 6,
            "year": "2013-2020",
            "rating": "TV-MA",
            "imdb": "8.5",
            "rt": 0,
            "awards": "Won 1 Primetime Emmy. Another 40 wins & 128 nominations.",
            "desc": "Vikings transports us to the brutal and mysterious world of Ragnar Lothbrok, a Viking warrior and farmer who yearns to explore - and raid - the distant shores across the ocean.",
            "stars": "Katheryn Winnick, Gustaf Skarsgård, Alexander Ludwig, Georgia Hirst",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2013-02-25",
                    "episode_count": 8,
                    "id": 53335,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/woP1jNltcWMLqK6pcFqPJq6pyJ6.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2013-03-03",
                    "episode_count": 9,
                    "id": 53334,
                    "name": "Season 1",
                    "overview": "",
                    "poster_path": "/uYaskJzmBhBdvkitDTjlH6gj9Pt.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2014-02-27",
                    "episode_count": 10,
                    "id": 53336,
                    "name": "Season 2",
                    "overview": "Season two brings crises of faith, of power, of relationships. Brothers rise up against one another. Loyalties shift from friend to foe, and unlikely alliances are formed in the name of supremacy. Ragnar’s indiscretions threaten his marriage to Lagertha, tearing him and his beloved son apart. Plots are hatched, scores are settled, blood is spilled…all under the watchful eyes of the gods.",
                    "poster_path": "/g2Pgu5Dae9P99yJs0xZQtEagA76.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2015-02-19",
                    "episode_count": 10,
                    "id": 64422,
                    "name": "Season 3",
                    "overview": "With the promise of new land from the English, Ragnar leads his people to an uncertain fate on the shores of Wessex. King Ecbert has made many promises and it remains to be seen if he will keep them. But ever the restless wanderer, Ragnar is searching for something more … and he finds it in the mythical city of Paris.",
                    "poster_path": "/jICv5UxLDvUqCp1D2jAb0PSJWAw.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2016-02-18",
                    "episode_count": 20,
                    "id": 72979,
                    "name": "Season 4",
                    "overview": "A ferocious battle between the Vikings and the French eventually comes down to Ragnar against Rollo. The outcome will seal the fate of the two brothers.",
                    "poster_path": "/nHJHNRApy8vmTUvZx59l1f1GXzB.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2017-11-29",
                    "episode_count": 20,
                    "id": 88459,
                    "name": "Season 5",
                    "overview": "Season five begins with Ivar the Boneless asserting his leadership over the Great Heathen Army, while Lagertha reigns as Queen of Kattegat. Ivar’s murder of his brother Sigurd sets the stage for vicious battles to come as Ragnar’s sons plot their next moves after avenging their father’s death. Bjorn follows his destiny into the Mediterranean Sea and Floki who is suffering from the loss of his wife Helga, takes to the seas submitting himself to the will of the Gods. This season is full of startling alliances and unbelievable betrayals as the Vikings fight to rule the world.",
                    "poster_path": "/aFfwMjFhb05O2mC5hCfoEPPJ8xL.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2019-12-04",
                    "episode_count": 20,
                    "id": 133827,
                    "name": "Season 6",
                    "overview": "The final season finds Bjorn now the king of Kattegat, while Ivar is a fugitive in Russia and Lagertha plans a peaceful retirement to a country farm.",
                    "poster_path": "/3h0EDCz4eIefTUxHZaNaYwcRw47.jpg",
                    "season_number": 6
                }
            ],
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "History",
                "Romance",
                "War"
            ],
            "poster": "/bQLrHIRNEkE3PdIWQrZHynQZazu.jpg"
        },
        {
            "creator": "Marta Kauffman",
            "title": "Friends",
            "nos": 10,
            "year": "1994-2004",
            "rating": "TV-PG",
            "imdb": "8.9",
            "rt": 0,
            "awards": "Won 6 Primetime Emmys. Another 71 wins & 220 nominations.",
            "desc": "Follows the personal and professional lives of six twenty to thirty-something-year-old friends living in Manhattan.",
            "stars": "Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2001-02-15",
                    "episode_count": 39,
                    "id": 4583,
                    "name": "Specials",
                    "overview": "The cast of the celebrated hit series \"Friends\" reunites to dish on the success of the series following the iconic sitcom's 25th anniversary.",
                    "poster_path": "/nZft2oL2tvE9LqBpQGJODdBlkml.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "1994-09-22",
                    "episode_count": 24,
                    "id": 4573,
                    "name": "Season 1",
                    "overview": "The first season introduces the six main characters who live in New York City: Rachel Green, a waitress; professional chef Monica Geller; her paleontologist brother, Ross Geller; free-spirited masseuse Phoebe Buffay; struggling actor Joey Tribbiani, and Ross's college friend, Chandler Bing, whose precise occupation at a corporation is unknown.",
                    "poster_path": "/odCW88Cq5hAF0ZFVOkeJmeQv1nV.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "1995-09-21",
                    "episode_count": 24,
                    "id": 4574,
                    "name": "Season 2",
                    "overview": "Rachel gets jealous of Ross's new girlfriend, Monica dates an older man, and Joey stars on a soap opera as the hit sitcom hits its stride in Season 2.",
                    "poster_path": "/kC9VHoMh1KkoAYfsY3QlHpZRxDy.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "1996-09-16",
                    "episode_count": 25,
                    "id": 4575,
                    "name": "Season 3",
                    "overview": "Season 3 takes on a significantly more serialized format. Chandler and Janice date for several episodes until Joey catches Janice kissing her soon-to-be ex-husband. Not wanting to destroy her family, Chandler urges Janice to go back to her husband, then becomes depressed over the breakup for several episodes",
                    "poster_path": "/n9u4pslqb6tpiLc8soldL5IbAyG.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "1997-09-25",
                    "episode_count": 24,
                    "id": 4576,
                    "name": "Season 4",
                    "overview": "Chandler makes amends to Joey by spending Thanksgiving in a box, Monica finally lands her dream job of head chef, and Phoebe supports her brother.",
                    "poster_path": "/3WdH3FNMXgp3Qlx21T7kwKS8Mtc.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "1998-09-24",
                    "episode_count": 24,
                    "id": 4577,
                    "name": "Season 5",
                    "overview": "The friends continue to haphazardly navigate their way through Manhattan, landing in more improbable situations than anyone has a right to imagine.",
                    "poster_path": "/aEwLXWbo6gV1TNIv9veu4rRwsPZ.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "1999-09-23",
                    "episode_count": 25,
                    "id": 4578,
                    "name": "Season 6",
                    "overview": "In Season 6 of the Emmy-winning series, Ross doesn't tell Rachel that their accidental marriage was never annulled, but he does tell Phoebe.",
                    "poster_path": "/7EU6bV6d8j1Xbc1F8QoNkOZrpsi.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2000-10-12",
                    "episode_count": 24,
                    "id": 4579,
                    "name": "Season 7",
                    "overview": "Monica and Chandler prepare for their wedding but must deal with a competition between Rachel and Phoebe to be Monica's maid of honor.",
                    "poster_path": "/yvUZVChjOnqCjB9rjdEqEmpDdnQ.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2001-09-27",
                    "episode_count": 24,
                    "id": 4580,
                    "name": "Season 8",
                    "overview": "Rachel is pregnant and faces single parenthood, while Joey agonizes over his feelings for her. Chandler and Monica are now dealing with married life.",
                    "poster_path": "/eh6PPkrzkXsEksRJDcdtx9lZsqX.jpg",
                    "season_number": 8
                },
                {
                    "air_date": "2002-09-23",
                    "episode_count": 24,
                    "id": 4581,
                    "name": "Season 9",
                    "overview": "Rachel finds herself surprisingly adept at taking care of Emma but struggles to define her complicated relationships with Joey and Ross.",
                    "poster_path": "/1IvIdN4I5jJ0bwC3BkmDCy4pQ9j.jpg",
                    "season_number": 9
                },
                {
                    "air_date": "2003-09-25",
                    "episode_count": 18,
                    "id": 4582,
                    "name": "Season 10",
                    "overview": "The tenth season brings several long-running story lines to a close. Joey and Rachel try to contend with Ross's feelings about their relationship, and after disastrous attempts to consummate, decide it is best they remain friends. Charlie breaks up with Ross to get back together with her ex-boyfriend.",
                    "poster_path": "/67ETB6XIqYc5vZkyAjN8XINOX5i.jpg",
                    "season_number": 10
                }
            ],
            "genres": [
                "Comedy",
                "Romance"
            ],
            "poster": "/f496cm9enuEsZkSPzCwnTESEK5s.jpg"
        },
        {
            "creator": "Trey Parker",
            "title": "South Park",
            "nos": 24,
            "year": "1997-",
            "rating": "TV-MA",
            "imdb": "8.7",
            "rt": 0,
            "awards": "Won 5 Primetime Emmys. 18 wins & 87 nominations total",
            "desc": "Follows the misadventures of four irreverent grade-schoolers in the quiet, dysfunctional town of South Park, Colorado.",
            "stars": "Trey Parker, Matt Stone, Isaac Hayes",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "1992-12-08",
                    "episode_count": 33,
                    "id": 6718,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/zDWaLg5X7mVfqsa5L4YmFmkDDqT.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "1997-08-13",
                    "episode_count": 13,
                    "id": 6705,
                    "name": "Season 1",
                    "overview": "This is the season that started it all! Join Stan, Kyle Cartman and Kenny as these four animated tykes take on the supernatural, the extraordinary and the insane. For them, it’s all part of growing up in South Park.",
                    "poster_path": "/sxCj0Iun46sUUsF5I2NQY6rml4c.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "1998-04-01",
                    "episode_count": 18,
                    "id": 6706,
                    "name": "Season 2",
                    "overview": "Join Stan, Kyle, Cartman and Kenny as they discover the identity of Cartman's father, learn about Conjoined Twin-Myslexia and thaw a prehistoric ice man. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/oIDheshe9DYsviYn0qVy4yutrRp.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "1999-04-07",
                    "episode_count": 17,
                    "id": 6707,
                    "name": "Season 3",
                    "overview": "Return to everyone’s favorite mountain town for seventeen outrageously bizarre episodes of South Park. Along the way, you’ll meet the Succubus, get caught up in the Chinpokomon frenzy and find out why citizens are spontaneously combusting.",
                    "poster_path": "/x3jdSHgjyps2VQPmJ6KKgZqVEcE.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2000-04-05",
                    "episode_count": 17,
                    "id": 6708,
                    "name": "Season 4",
                    "overview": "Join Stan, Kyle, Cartman and Kenny as they graduate to 4th grade, join in the 2000 election recount, the controversy over Saddam Hussein, and the introduction of Timmy!!! For them, it’s all part of growing up in South Park!",
                    "poster_path": "/hAnKP4GRgOVx4XxA8OgSxmiyXNr.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2001-06-20",
                    "episode_count": 14,
                    "id": 6709,
                    "name": "Season 5",
                    "overview": "Join Stan, Kyle, Cartman and Kenny as they welcome Jimmy the new handi-capable kid in town & Towelie, Radiohead guest stars, Big Gay Al returns, and Terrance and Phillip break up. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/mbNzB0ji7QpHAMNnf0xpAJYoQWJ.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2002-03-06",
                    "episode_count": 17,
                    "id": 6710,
                    "name": "Season 6",
                    "overview": "In this series Stan convinces the boys to kidnap all the calves from a local farm after a look at how veal is made turns him vegetarian; Professor Chaos struggles to find an evil scheme that hasn't already been done on 'The Simpsons'; and when Bebe's breasts begin to take shape, the boys can't understand why they're suddenly interested in her.",
                    "poster_path": "/7nKjCuBH0tGkLwBwxDgxbBrNj5F.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2003-03-19",
                    "episode_count": 15,
                    "id": 6711,
                    "name": "Season 7",
                    "overview": "Join Stan, Kyle, Cartman and Kenny as they go gaga for “Queer Eye,” start their own Christian Rock Band, and discover that Earth is an intergalactic reality show that's about to be cancelled. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/zYHoEtNxkdAa4g8wPdBdGq8VOzC.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2004-03-17",
                    "episode_count": 14,
                    "id": 6712,
                    "name": "Season 8",
                    "overview": "Join Stan, Kyle, Cartman and Kenny as they witness the girls’ celebrity-worship of ditzy, rich, sex-tape-making socialites and take part in an awesome anime battle with Professor Chaos. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/aTTmEQqmlVGNHNKJ8K4rFAnZrPo.jpg",
                    "season_number": 8
                },
                {
                    "air_date": "2005-03-09",
                    "episode_count": 14,
                    "id": 6713,
                    "name": "Season 9",
                    "overview": "Join Stan, Kyle, Cartman and Kenny as they deal with the perceived dangers of global warming, a certain actor's sexuality is questioned, and the Pope arrives to witness a religious miracle. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/5cCxlgStfCVaaZtBuxmIVlHeoli.jpg",
                    "season_number": 9
                },
                {
                    "air_date": "2006-03-22",
                    "episode_count": 14,
                    "id": 6714,
                    "name": "Season 10",
                    "overview": "Join Stan, Kyle, Cartman and Kenny as they witness the death of Chef, defeat a virtual villain out to destroy the world, and suffer the consequences of Cartman’s video game console obsession. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/brFCz0wW2bRyOyK81OqwDiJDmFA.jpg",
                    "season_number": 10
                },
                {
                    "air_date": "2007-03-07",
                    "episode_count": 14,
                    "id": 6722,
                    "name": "Season 11",
                    "overview": "It’s a season of diabolical secrets as Cartman covers up a salacious photo and the boys reveal a bizarre Easter society. An explosive visit from Hillary Clinton, a world-record crap and the Imaginationland trilogy only add to the awesomeness of Season 11.",
                    "poster_path": "/cVfhCT2wZq3hHCp8i2II8hHjOOg.jpg",
                    "season_number": 11
                },
                {
                    "air_date": "2008-03-12",
                    "episode_count": 14,
                    "id": 6715,
                    "name": "Season 12",
                    "overview": "Join Stan, Kyle, Cartman and Kenny as they help a pop-princess down on her luck, negotiate a truce for striking Canadians, fight the addiction of \"cheesing\" and battle startling rodents. For them, it's all part of growing up in South Park",
                    "poster_path": "/wVDJyjekgMXqkVAmvplwkVfL9qX.jpg",
                    "season_number": 12
                },
                {
                    "air_date": "2009-03-11",
                    "episode_count": 14,
                    "id": 6716,
                    "name": "Season 13",
                    "overview": "Join Cartman, Kenny, Stan and Kyle as they save the economy, the whales, and a bunch of dead celebrities all while discovering the joys of Fish Sticks. For them, it's all part of growing up in South Park",
                    "poster_path": "/15Lszg1L3w6vGGqFFoTN0asxj5C.jpg",
                    "season_number": 13
                },
                {
                    "air_date": "2010-03-17",
                    "episode_count": 14,
                    "id": 6717,
                    "name": "Season 14",
                    "overview": "This series finds Stan, Kyle, Cartman, Kenny, Butters and co getting into fixes through their usual blend of innocence and mischievousness. As well as coming to terms with the perils of social networking and being accused of sex addiction in the furore that sweeps the nation in the wake of the revelations surrounding Tiger Woods, the boys finally reveal the identity of the suitably mysterious Mysterion in a three-part special.",
                    "poster_path": "/6Xik83L9tCmLqh0cdxoopOsQm69.jpg",
                    "season_number": 14
                },
                {
                    "air_date": "2011-04-27",
                    "episode_count": 14,
                    "id": 6719,
                    "name": "Season 15",
                    "overview": "Join Stan, Kyle, Cartman and Kenny in the fifteenth season as they confront modern mad scientists, fundamentalist agnostics, and face their greatest challenge yet -- Stan growing a year older. For them, it's all part of growing up in South Park.",
                    "poster_path": "/6T31LPecW0wIB05VOExvaAssd4f.jpg",
                    "season_number": 15
                },
                {
                    "air_date": "2012-03-14",
                    "episode_count": 14,
                    "id": 6720,
                    "name": "Season 16",
                    "overview": "Join Cartman, Kenny, Stan and Kyle as they hunt down the mythical Jewpacabra, ‘sketti wrestle with reality stars, and go jackin’ it in San Diego. For them, it's all part of growing up in South Park.",
                    "poster_path": "/rYIXqHRPDKMhyx6fPi5DosDGniq.jpg",
                    "season_number": 16
                },
                {
                    "air_date": "2013-09-25",
                    "episode_count": 10,
                    "id": 6721,
                    "name": "Season 17",
                    "overview": "Join Stan, Kyle, Cartman and Princess Kenny as they infiltrate the NSA, thwart patient zero, tame some strange and fight in the greatest battle of their young, hot lives.",
                    "poster_path": "/spuqYJjCgZZyk0d9OTIRHAyeDaF.jpg",
                    "season_number": 17
                },
                {
                    "air_date": "2014-09-24",
                    "episode_count": 10,
                    "id": 62784,
                    "name": "Season 18",
                    "overview": "Join Cartman, Kenny, Stan and Kyle as they get lost in virtual reality, go underground with Cock Magic, and uncover the shocking truth about a music superstar. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/5IMCLoCtNOyHHYS4dZqMNkwELhU.jpg",
                    "season_number": 18
                },
                {
                    "air_date": "2015-09-16",
                    "episode_count": 10,
                    "id": 70512,
                    "name": "Season 19",
                    "overview": "Join Cartman, Kenny, Stan and Kyle as Mr. Garrison makes a bid for the White House, Randy takes the lead in gentrifying the town, and everyone is looking for their safe space. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/7iMBDcRWcCLjeDiZa6Dd3MGgSIm.jpg",
                    "season_number": 19
                },
                {
                    "air_date": "2016-09-14",
                    "episode_count": 10,
                    "id": 78669,
                    "name": "Season 20",
                    "overview": "Join Cartman, Kenny, Stan and Kyle as they confront online trolling, face the member berry epidemic, and come to terms with Cartman having a girlfriend. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/tQvfdzJFMV70grQBB9ylv35ChGW.jpg",
                    "season_number": 20
                },
                {
                    "air_date": "2017-09-13",
                    "episode_count": 10,
                    "id": 92690,
                    "name": "Season 21",
                    "overview": "Join Cartman, Kenny, Stan, and Kyle as they take on the opioid epidemic, experiment with water bears, dig into the underbelly of social media and go to war with Canada. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/6JJ0UUH5dto0Vd9PHxFmO8BHlva.jpg",
                    "season_number": 21
                },
                {
                    "air_date": "2018-09-26",
                    "episode_count": 10,
                    "id": 109933,
                    "name": "Season 22",
                    "overview": "Join Stan, Kyle, Cartman, Kenny as they deal the vaping epidemic, Cartman’s anxiety disorder, and the fact that they didn't take the threat of ManBearPig \"cereal\" enough the first time around. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/4pRzNSVOnORKXdSrXk76SQi4Ghm.jpg",
                    "season_number": 22
                },
                {
                    "air_date": "2019-09-25",
                    "episode_count": 10,
                    "id": 131142,
                    "name": "Season 23",
                    "overview": "Join Stan, Kyle, Cartman, Kenny, and Randy as they explore the wonders of the human biome, tackle the consequences of immigration, and get banned in China. For them, it’s all part of growing up in South Park!",
                    "poster_path": "/to2dtGxOcgpbkjZNSXizDZbrihn.jpg",
                    "season_number": 23
                },
                {
                    "air_date": "2020-09-30",
                    "episode_count": 2,
                    "id": 164444,
                    "name": "Season 24",
                    "overview": "",
                    "poster_path": "/g22mpMV5LszB0ShKFW0CLxUDK3U.jpg",
                    "season_number": 24
                }
            ],
            "genres": [
                "Animation",
                "Comedy"
            ],
            "poster": "/iiCY2QIGSnmtVkIdjkKAfwDs0KF.jpg"
        },
        {
            "creator": "David Benioff",
            "title": "Game of Thrones",
            "nos": 8,
            "year": "2011-2019",
            "rating": "TV-MA",
            "imdb": "9.3",
            "rt": 0,
            "awards": "Won 59 Primetime Emmys. 378 wins & 618 nominations total",
            "desc": "Nine noble families fight for control over the lands of Westeros, while an ancient enemy returns after being dormant for millennia.",
            "stars": "Emilia Clarke, Peter Dinklage, Kit Harington",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2010-12-05",
                    "episode_count": 176,
                    "id": 3627,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/kMTcwNRfFKCZ0O2OaBZS0nZ2AIe.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2011-04-17",
                    "episode_count": 10,
                    "id": 3624,
                    "name": "Season 1",
                    "overview": "Trouble is brewing in the Seven Kingdoms of Westeros. For the driven inhabitants of this visionary world, control of Westeros' Iron Throne holds the lure of great power. But in a land where the seasons can last a lifetime, winter is coming...and beyond the Great Wall that protects them, an ancient evil has returned. In Season One, the story centers on three primary areas: the Stark and the Lannister families, whose designs on controlling the throne threaten a tenuous peace; the dragon princess Daenerys, heir to the former dynasty, who waits just over the Narrow Sea with her malevolent brother Viserys; and the Great Wall--a massive barrier of ice where a forgotten danger is stirring.",
                    "poster_path": "/zwaj4egrhnXOBIit1tyb4Sbt3KP.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2012-04-01",
                    "episode_count": 10,
                    "id": 3625,
                    "name": "Season 2",
                    "overview": "The cold winds of winter are rising in Westeros...war is coming...and five kings continue their savage quest for control of the all-powerful Iron Throne. With winter fast approaching, the coveted Iron Throne is occupied by the cruel Joffrey, counseled by his conniving mother Cersei and uncle Tyrion. But the Lannister hold on the Throne is under assault on many fronts. Meanwhile, a new leader is rising among the wildings outside the Great Wall, adding new perils for Jon Snow and the order of the Night's Watch.",
                    "poster_path": "/5tuhCkqPOT20XPwwi9NhFnC1g9R.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2013-03-31",
                    "episode_count": 10,
                    "id": 3626,
                    "name": "Season 3",
                    "overview": "Duplicity and treachery...nobility and honor...conquest and triumph...and, of course, dragons. In Season 3, family and loyalty are the overarching themes as many critical storylines from the first two seasons come to a brutal head. Meanwhile, the Lannisters maintain their hold on King's Landing, though stirrings in the North threaten to alter the balance of power; Robb Stark, King of the North, faces a major calamity as he tries to build on his victories; a massive army of wildlings led by Mance Rayder march for the Wall; and Daenerys Targaryen--reunited with her dragons--attempts to raise an army in her quest for the Iron Throne.",
                    "poster_path": "/7d3vRgbmnrRQ39Qmzd66bQyY7Is.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2014-04-06",
                    "episode_count": 10,
                    "id": 3628,
                    "name": "Season 4",
                    "overview": "The War of the Five Kings is drawing to a close, but new intrigues and plots are in motion, and the surviving factions must contend with enemies not only outside their ranks, but within.",
                    "poster_path": "/dniQ7zw3mbLJkd1U0gdFEh4b24O.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2015-04-12",
                    "episode_count": 10,
                    "id": 62090,
                    "name": "Season 5",
                    "overview": "The War of the Five Kings, once thought to be drawing to a close, is instead entering a new and more chaotic phase. Westeros is on the brink of collapse, and many are seizing what they can while the realm implodes, like a corpse making a feast for crows.",
                    "poster_path": "/527sR9hNDcgVDKNUE3QYra95vP5.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2016-04-24",
                    "episode_count": 10,
                    "id": 71881,
                    "name": "Season 6",
                    "overview": "Following the shocking developments at the conclusion of season five, survivors from all parts of Westeros and Essos regroup to press forward, inexorably, towards their uncertain individual fates. Familiar faces will forge new alliances to bolster their strategic chances at survival, while new characters will emerge to challenge the balance of power in the east, west, north and south.",
                    "poster_path": "/zvYrzLMfPIenxoq2jFY4eExbRv8.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2017-07-16",
                    "episode_count": 7,
                    "id": 81266,
                    "name": "Season 7",
                    "overview": "The long winter is here. And with it comes a convergence of armies and attitudes that have been brewing for years.",
                    "poster_path": "/3dqzU3F3dZpAripEx9kRnijXbOj.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2019-04-14",
                    "episode_count": 6,
                    "id": 107971,
                    "name": "Season 8",
                    "overview": "The Great War has come, the Wall has fallen and the Night King's army of the dead marches towards Westeros. The end is here, but who will take the Iron Throne?",
                    "poster_path": "/39FHkTLnNMjMVXdIDwZN8SxYqD6.jpg",
                    "season_number": 8
                }
            ],
            "genres": [
                "Action",
                "Adventure",
                "Drama"
            ],
            "poster": "/u3bZgnGQ9T01sWNhyveQz0wH0Hl.jpg"
        },
        {
            "creator": "Vince Gilligan",
            "title": "Breaking Bad",
            "nos": 5,
            "year": "2008-2013",
            "rating": "TV-MA",
            "imdb": "9.4",
            "rt": 0,
            "awards": "Won 16 Primetime Emmys. 152 wins & 238 nominations total",
            "desc": "A high school chemistry teacher diagnosed with inoperable lung cancer turns to manufacturing and selling methamphetamine in order to secure his family's future.",
            "stars": "Bryan Cranston, Aaron Paul, Anna Gunn",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2009-02-16",
                    "episode_count": 11,
                    "id": 3577,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/AngNuUbXSciwLnUXtdOBHqphxNr.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2008-01-20",
                    "episode_count": 7,
                    "id": 3572,
                    "name": "Season 1",
                    "overview": "High school chemistry teacher Walter White's life is suddenly transformed by a dire medical diagnosis. Street-savvy former student Jesse Pinkman \"teaches\" Walter a new trade.",
                    "poster_path": "/1BP4xYv9ZG4ZVHkL7ocOziBbSYH.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2009-03-08",
                    "episode_count": 13,
                    "id": 3573,
                    "name": "Season 2",
                    "overview": "In the second season, Walt must deal with the chain reaction of his choice, as he and Jesse face new and severe consequences. When danger and suspicion around Walt escalate, he is pushed to new levels of desperation. Just how much higher will the stakes rise? How far is Walt willing to go to ensure his family's security? Will his grand plan spiral out of control?",
                    "poster_path": "/e3oGYpoTUhOFK0BJfloru5ZmGV.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2010-03-21",
                    "episode_count": 13,
                    "id": 3575,
                    "name": "Season 3",
                    "overview": "In the third season, Walt continues to battle dueling identities: a desperate husband and father trying to provide for his family, and a newly appointed key player in the Albuquerque drug trade. As the danger around him escalates, Walt is now entrenched in the complex worlds of an angst-ridden family on the verge of dissolution, and the ruthless and unrelenting drug cartel.",
                    "poster_path": "/ffP8Q8ew048YofHRnFVM18B2fPG.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2011-07-17",
                    "episode_count": 13,
                    "id": 3576,
                    "name": "Season 4",
                    "overview": "This season, Walt and Jesse must cope with the fallout of their previous actions, both personally and professionally. Tension mounts as Walt faces a true standoff with his employer, Gus, with neither side willing or able to back down. Walt must also adjust to a new relationship with Skyler, whom while still reconciling her relationship with Walt, is committed to properly laundering Walt’s money and ensuring her sister Marie and an ailing Hank are financially stable.",
                    "poster_path": "/5ewrnKp4TboU4hTLT5cWO350mHj.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2012-07-15",
                    "episode_count": 16,
                    "id": 3578,
                    "name": "Season 5",
                    "overview": "In season five, Walt is faced with the prospect of moving on in a world without his enemy. As the pressure of a criminal life starts to build, Skyler struggles to keep Walt’s terrible secrets. Facing resistance from sometime adversary and former Fring lieutenant Mike, Walt tries to keep his world from falling apart even as his DEA Agent brother in law, Hank, finds numerous leads that could blaze a path straight to Walt. \n\nAll bad things must come to an end.",
                    "poster_path": "/r3z70vunihrAkjILQKWHX0G2xzO.jpg",
                    "season_number": 5
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Thriller"
            ],
            "poster": "/ggFHVNu6YYI5L9pCfOacjizRGt.jpg"
        },
        {
            "creator": "David Simon",
            "title": "The Wire",
            "nos": 5,
            "year": "2002-2008",
            "rating": "TV-MA",
            "imdb": "9.3",
            "rt": 0,
            "awards": "Nominated for 2 Primetime Emmys. Another 16 wins & 52 nominations.",
            "desc": "The Baltimore drug scene, as seen through the eyes of drug dealers and law enforcement.",
            "stars": "Dominic West, John Doman, Deirdre Lovejoy, Wendell Pierce",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2006-08-19",
                    "episode_count": 7,
                    "id": 3853,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/dXq8SkQuxzs7uNdLIWYec5l1JSG.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2002-06-02",
                    "episode_count": 13,
                    "id": 3848,
                    "name": "Season 1",
                    "overview": "On the drug-infested streets of West Baltimore, there are good guys and there are bad guys. Sometimes you need more than a badge to tell them apart. Season 1 follows a single sprawling drug and murder investigation in Baltimore — one that culminates in a complex series of dangerous wiretaps and surveillance.",
                    "poster_path": "/blgnd2APWtxsxGyctmZyaMPO4Ym.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2003-06-01",
                    "episode_count": 12,
                    "id": 3849,
                    "name": "Season 2",
                    "overview": "McNulty's on harbor patrol. Daniels is in the police-archives dungeon. Prez is chafing in the suburbs. Greggs has a desk job. The detail may be on ice, but corruption marches on . . . and a horrific discovery is about to turn the Baltimore shipping port inside out. Setting up in the wake of the first season's joint homicide/narcotics detail that exposed a major drug operation — and left its members stigmatized and reassigned — the second season expands to include not only familiar drug dealers, but a group of longshoremen and organized crime members who are caught up in a major homicide case.",
                    "poster_path": "/scOZiOzUePpz7JnWRpjI8HcY1RU.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2004-09-19",
                    "episode_count": 12,
                    "id": 3850,
                    "name": "Season 3",
                    "overview": "The heat is on in Baltimore. The drug war is being lost, bodies are piling up, and a desperate mayor wants the tide turned before the election. But the police department hasn't got any answers. Wiretaps haven’t worked. Neither have stakeouts or street busts. With the demolition of the Franklin Terrace towers, Stringer Bell and the Barksdale crew have been forced to improvise. But no matter how hard McNulty and the detail try, the dealers always seem to be one step ahead of the game. It’s time to change the rules.",
                    "poster_path": "/mWo4dHE0XXsKgZOQQCtkHl3IHrf.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2006-09-10",
                    "episode_count": 13,
                    "id": 3851,
                    "name": "Season 4",
                    "overview": "In the projects. On the docks. In City Hall. And now, in the schools. The places and faces change, but the game remains the same. A new story begins. This year, while expanding on storylines introduced in previous seasons — including the new vocations of several characters, the rise of a new drug empire, and the city's imminent mayoral election — the series expands its focus into Baltimore's school system, providing an inside look at the role of the urban educational system in shaping young people's lives. This storyline is played out through four new young characters, each of whom faces difficult choices amidst the temptation of crime and easy money.",
                    "poster_path": "/jxSJdEX6jmODu3eglC8j4Kv2Gll.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2008-01-06",
                    "episode_count": 10,
                    "id": 3852,
                    "name": "Season 5",
                    "overview": "In the projects. On the docks. In City Hall. In the schools. And now, in the media. The places and faces change, but the game remains the same. In the fifth — and final — season, the series expands its focus into the media — specifically the role of newspapers in big-city bureaucracy — as it follows a newspaper staff as they struggle to maintain integrity and meet deadlines in the face of budget cuts and staff reductions.",
                    "poster_path": "/eAU1JwadhNBar0xaxxVW3frlkM5.jpg",
                    "season_number": 5
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Thriller"
            ],
            "poster": "/4lbclFySvugI51fwsyxBTOm4DqK.jpg"
        },
        {
            "creator": "David Chase",
            "title": "The Sopranos",
            "nos": 6,
            "year": "1999-2007",
            "rating": "TV-MA",
            "imdb": "9.2",
            "rt": 0,
            "awards": "Won 21 Primetime Emmys. 120 wins & 309 nominations total",
            "desc": "New Jersey mob boss Tony Soprano deals with personal and professional issues in his home and business life that affect his mental state, leading him to seek professional psychiatric counseling.",
            "stars": "James Gandolfini, Lorraine Bracco, Edie Falco",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2007-01-01",
                    "episode_count": 7,
                    "id": 3623,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/kvasNmTeZd6YwjhZASAHlijeVi9.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "1999-01-10",
                    "episode_count": 13,
                    "id": 3617,
                    "name": "Season 1",
                    "overview": "In Season 1, feeling his handle on his family and his business slipping away, mob boss Tony Soprano suffers a series of anxiety attacks that land him in the office of a psychiatrist. Opening up to his shrink, Tony relates the details of his life as a “waste-management consultant,” and tries to come to terms with the professional and private strains that have brought him to the brink of a breakdown.",
                    "poster_path": "/3NsJzafk0Sp7yE9yShzQsybHw4x.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2000-01-16",
                    "episode_count": 13,
                    "id": 3618,
                    "name": "Season 2",
                    "overview": "His uncle's in jail. His mother's in the hospital. His best friend's still missing. His sister's moving home. His panic attacks are back. And his shrink refuses to see him. Tony Soprano has recently been elevated to the status of mob boss following a federal bust and as the second season picks up, Tony is under more stress than ever as he deals with the demands of his new position. Making matters worse, his long-lost sister Janice has arrived to take care of their ailing mother.",
                    "poster_path": "/wvCOKWM1abB5CfuWKqDYeMRV3lN.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2001-03-04",
                    "episode_count": 13,
                    "id": 3619,
                    "name": "Season 3",
                    "overview": "In season three, the federal wiretap begins and Meadow goes to college. Tony faces challenges from some tough newcomers, such as hothead Ralph Cifaretto, New York crime boss Johnny Sack and a sexy car saleswoman.",
                    "poster_path": "/zFuz2PgkHDr9Lx5YAEmiWbXKCio.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2002-09-15",
                    "episode_count": 13,
                    "id": 3620,
                    "name": "Season 4",
                    "overview": "With Paulie in jail, Christopher becomes acting capo in season four. Junior faces a RICO trial while Tony finds that the recession affects his businesses. Meanwhile, Furio catches Carmela's eye, and Janice sets her sights on Bobby.",
                    "poster_path": "/q01fVFY7rQEMMnexa9Urv7NOdKO.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2004-03-07",
                    "episode_count": 13,
                    "id": 3621,
                    "name": "Season 5",
                    "overview": "In season five, a separated Tony and Carmela negotiate family and money issues. Meanwhile, Tony's reunion with paroled cousin Tony Blundetto may endanger his alliance with Johnny Sack; and Adriana gets in deeper with the Feds.",
                    "poster_path": "/p651eYM0Vd0CWDvndbMyaS0lDeD.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2006-03-12",
                    "episode_count": 21,
                    "id": 3622,
                    "name": "Season 6",
                    "overview": "As the final episodes take shape, Tony faces a myriad of stress-inducing crises at home, at work, and from the law. While his wife and children each make choices that promise to change the face of the Sopranos' domestic life, Tony also comes to doubt the allegiances of some of those closest to him at work . . . none of whom is above suspicion.",
                    "poster_path": "/b1P9PAUI18mb62N0DtHOd71L3CT.jpg",
                    "season_number": 6
                }
            ],
            "genres": [
                "Crime",
                "Drama"
            ],
            "poster": "/57okJJUBK0AaijxLh3RjNUaMvFI.jpg"
        },
        {
            "creator": "Mark Williams",
            "title": "Ozark",
            "nos": 4,
            "year": "2017-",
            "rating": "TV-MA",
            "imdb": "8.4",
            "rt": 0,
            "awards": "Won 3 Primetime Emmys. 18 wins & 118 nominations total",
            "desc": "A financial advisor drags his family from Chicago to the Missouri Ozarks, where he must launder money to appease a drug boss.",
            "stars": "Jason Bateman, Laura Linney, Sofia Hublitz",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2017-07-21",
                    "episode_count": 10,
                    "id": 84057,
                    "name": "Season 1",
                    "overview": "",
                    "poster_path": "/x7M93pIs7spQRLjtcNra1dDemxx.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2018-08-31",
                    "episode_count": 10,
                    "id": 105425,
                    "name": "Season 2",
                    "overview": "Marty's plan to open a riverboat casino is complicated by Darlene Snell's schemes, Ruth's paroled father, state politics and a Kansas City mobster.",
                    "poster_path": "/pXAR26dF40FTJc6TkfALlnRGxcT.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2020-03-27",
                    "episode_count": 10,
                    "id": 140314,
                    "name": "Season 3",
                    "overview": "Business as usual? No such thing. As Marty and Wendy clash over whether or not to expand, a surprise visitor turns their personal lives upside down.",
                    "poster_path": "/ptRaE7lPLbrM0cuwoDKHHisZPMi.jpg",
                    "season_number": 3
                },
                {
                    "air_date": null,
                    "episode_count": 1,
                    "id": 183557,
                    "name": "Season 4",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 4
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Thriller"
            ],
            "poster": "/oy7Peo5iFIt9sNM59lN6csbJeX2.jpg"
        },
        {
            "creator": "Lauren Schmidt",
            "title": "The Witcher",
            "nos": 1,
            "year": "2019-",
            "rating": "TV-MA",
            "imdb": "8.2",
            "rt": 0,
            "awards": "8 nominations",
            "desc": "Geralt of Rivia, a solitary monster hunter, struggles to find his place in a world where people often prove more wicked than beasts.",
            "stars": "Henry Cavill, Anna Shaffer, Freya Allan",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2019-12-20",
                    "episode_count": 8,
                    "id": 88731,
                    "name": "Season 1",
                    "overview": "",
                    "poster_path": "/uZsV5ZIZQMHekWDQQMsBwN0C3yA.jpg",
                    "season_number": 1
                }
            ],
            "genres": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "poster": "/zrPpUlehQaBf8YX2NrVrKK8IEpf.jpg"
        },
        {
            "creator": "Gideon Raff",
            "title": "Homeland",
            "nos": 8,
            "year": "2011-2020",
            "rating": "TV-MA",
            "imdb": "8.3",
            "rt": 0,
            "awards": "Won 8 Primetime Emmys. 61 wins & 178 nominations total",
            "desc": "A bipolar CIA operative becomes convinced a prisoner of war has been turned by al-Qaeda and is planning to carry out a terrorist attack on American soil.",
            "stars": "Claire Danes, Mandy Patinkin, Damian Lewis",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2015-09-14",
                    "episode_count": 14,
                    "id": 3672,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/4vgD0eFonJtdKHUkIWT473AzCGv.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2011-10-02",
                    "episode_count": 12,
                    "id": 3670,
                    "name": "Season 1",
                    "overview": "Volatile CIA agent Carrie Mathison investigates and ultimately becomes obsessed with returned POW marine Nicholas Brody, who may or may not be an al-Qaeda-trained terrorist. Brody struggles to resume his domestic life with his wife and two children whom he barely knows. Saul tries his best to support his bipolar protégé while pursuing leads of his own and trying to hold his crumbling marriage together.",
                    "poster_path": "/bue7kwSwLCg0RcgDn2jmxvF3fii.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2012-09-30",
                    "episode_count": 12,
                    "id": 3671,
                    "name": "Season 2",
                    "overview": "Carrie continues her hunt for terrorist leader Abu Nazir while maintaining a complicated relationship with Brody that straddles the line between personal and professional. Brody is forced to work more closely with the CIA. Jessica Brody struggles to keep her family in tact despite increasing difficulty connecting with her husband. Saul discovers a clandestine plot.",
                    "poster_path": "/17P568HN9C6VZL6nGcrotGlOc1z.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2013-09-29",
                    "episode_count": 12,
                    "id": 3673,
                    "name": "Season 3",
                    "overview": "Carrie goes to extraordinary lengths to solve the latest crisis at the CIA while dealing with a deeply personal secret. Brody struggles to survive. Saul must walk a tightrope and play many opposing sides to keep his job at the CIA and try to revive his troubled marriage. Quinn has a crisis of faith.",
                    "poster_path": "/el14NoHsnqGie4yzHpqdBMvwJn3.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2014-10-05",
                    "episode_count": 12,
                    "id": 62029,
                    "name": "Season 4",
                    "overview": "Carrie's career at the CIA takes off when she becomes an overseas station chief in a highly volatile region, but every drone strike and tactical raid comes at a cost and she quickly learns the true price of power. Saul fights to stay in the intelligence game.",
                    "poster_path": "/gRyfQzqTZw99y0Q7ZkCFhmQHmJV.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2015-10-04",
                    "episode_count": 12,
                    "id": 64293,
                    "name": "Season 5",
                    "overview": "The game has changed for Carrie Mathison. Out of the CIA and living in Berlin, Carrie is trying to start a new life but realizes now she\u0092s the one with a target on her back. As the danger intensifies, and without Saul and Quinn to rely on, one thing becomes clear \u0096 she\u0092s never been at greater risk or with more to lose.",
                    "poster_path": "/gM0dL7vLoZJ45s1600dnNz4TQm5.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2017-01-15",
                    "episode_count": 12,
                    "id": 79305,
                    "name": "Season 6",
                    "overview": "Carrie Mathison is back in the US on the streets of New York, fighting for the protection of civil liberties and against the abuse of power within our government. She remains in opposition with Saul, who is still with the CIA.",
                    "poster_path": "/dldJvR6LrF6JQyeSgfjs2R1zzQo.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2018-02-11",
                    "episode_count": 12,
                    "id": 96516,
                    "name": "Season 7",
                    "overview": "After the attempted assassination of the president, Carrie Mathison is out of the White House while 200 members of the intelligence community are imprisoned. Now Carrie must prove that not all conspiracies are theories.",
                    "poster_path": "/8MJTGlizuWygPKE8Zh38mZSI2Fa.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2020-02-09",
                    "episode_count": 12,
                    "id": 128861,
                    "name": "Season 8",
                    "overview": "Carrie Mathison's body is healing, but her memory remains fractured. While trying to broker peace with the Taliban in Afghanistan, Saul is dependent on his protégé's expertise. Against medical advice, Saul asks Carrie to assist him one last time.",
                    "poster_path": "/lUcMje4uEuUp5UxG2LF7c9KlI4Z.jpg",
                    "season_number": 8
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Mystery"
            ],
            "poster": "/6GAvS2e6VIRsms9FpVt33PsCoEW.jpg"
        },
        {
            "creator": "Paul Scheuring",
            "title": "Prison Break",
            "nos": 5,
            "year": "2005-2017",
            "rating": "TV-14",
            "imdb": "8.3",
            "rt": 0,
            "awards": "Nominated for 1 Primetime Emmy. 8 wins & 32 nominations total",
            "desc": "Due to a political conspiracy, an innocent man is sent to death row and his only hope is his brother, who makes it his mission to deliberately get himself sent to the same prison in order to break the both of them out, from the insid",
            "stars": "Dominic Purcell, Wentworth Miller, Amaury Nolasco",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2005-10-11",
                    "episode_count": 10,
                    "id": 7135,
                    "name": "Specials",
                    "overview": "The movie covers the events which occurred in between the downfall of The Company and the finale of the series. It details the arrest and incarceration of Sara Tancredi, the final escape plan which Michael devises for Sara. It also reveals the ultimate fate of Gretchen Morgan.",
                    "poster_path": "/r4I83zsnxdkoyrVcYpnmgT9EcUD.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2005-08-28",
                    "episode_count": 22,
                    "id": 7132,
                    "name": "Season 1",
                    "overview": "Lincoln Burrows is currently on death row and scheduled to die in a few months for an assassination his younger brother Michael is convinced he did not commit. With no other options and time winding down, Michael takes drastic measures to get himself incarcerated alongside his brother in Fox River State Penitentiary. Once he's inside, Michael, a structural engineer with the blueprints for the prison, begins to execute an elaborate plan to break Lincoln out and prove him innocent.",
                    "poster_path": "/jnMW2qcOjgwsjHx6QkOIeXShsLi.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2006-08-21",
                    "episode_count": 22,
                    "id": 7133,
                    "name": "Season 2",
                    "overview": "In season two, Michael, Lincoln and six other inmates, including pickpocket Tweener and the mentally unstable Haywire, have ultimately escaped from Fox River. Once outside the prison walls, however, the escape truly begins as the convicts race for their lives while trying to avoid capture by the authorities. The pursuers are led by FBI agent Alexander Mahone, who is haunted by his own demons; vengeful prison guard Captain Brad Bellick, who, driven by his own personal vendetta, will also stop at nothing until the escapees are captured or killed; and Secret Service Agent Paul Kellerman, who, under President Reynolds' orders, will do anything to keep the truth about the conspiracy very much a secret.",
                    "poster_path": "/tXW8JAtHV3ieelR9RiSOrRNR0Vs.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2007-09-16",
                    "episode_count": 13,
                    "id": 7134,
                    "name": "Season 3",
                    "overview": "Just when they thought they were out, they are pulled back in — for the most dangerous escape ever. Season three finds Michael Scofield wrongly incarcerated in Sona, a hellish Panamanian prison where there are no rules, no guards, and no escape.",
                    "poster_path": "/varoTteeNDLQxUFiFmgMmaWkplG.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2008-08-31",
                    "episode_count": 22,
                    "id": 7136,
                    "name": "Season 4",
                    "overview": "After engineering a daring escape from the hellish, Panamanian prison Sona, brothers Michael Scofield and Lincoln Burrows are determined to seek justice against The Company, the shadowy group responsible for destroying their lives and killing the woman Michael loves, Dr. Sara Tancredi. Michael’s quest for vengeance leads him to Los Angeles, where his world is turned upside down when Company operative Gretchen/Susan B. Anthony informs him that Sara is still alive. Realizing the only way they will truly be free, Michael and Lincoln avow to find Sara and take down The Company. With the help of Homeland Security agent Don Self, they assemble a group of allies and familiar faces to accomplish their task: Mahone, Sucre, Bellick and computer expert Roland Glenn. Unfortunately for the brothers, they must also evade company assassin Wyatt and find an on-the-loose T-Bag. Michael and Lincoln soon discover the only thing harder than breaking out will be breaking in.",
                    "poster_path": "/nBQkn79gw8bUYZ5iKo35fk1HELF.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2017-04-04",
                    "episode_count": 9,
                    "id": 75021,
                    "name": "Season 5 - Resurrection",
                    "overview": "Seven years later, thanks to an information provided by T-Bag, Lincoln and Sara discover that Michael is still alive in a Yemen prison, so they develop a plan to get him out.",
                    "poster_path": "/1YwzKyKGen3498Ui2AjD9FUTkG2.jpg",
                    "season_number": 5
                }
            ],
            "genres": [
                "Action",
                "Crime",
                "Drama"
            ],
            "poster": "/oMFtDk8hgX9UM4dVEOJt8mcFmHC.jpg"
        },
        {
            "creator": "J.J. Abrams",
            "title": "Lost",
            "nos": 6,
            "year": "2004-2010",
            "rating": "TV-14",
            "imdb": "8.3",
            "rt": 0,
            "awards": "Won 10 Primetime Emmys. Another 103 wins & 398 nominations.",
            "desc": "The survivors of a plane crash are forced to work together in order to survive on a seemingly deserted tropical island.",
            "stars": "Jorge Garcia, Josh Holloway, Yunjin Kim, Evangeline Lilly",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2005-04-27",
                    "episode_count": 30,
                    "id": 14047,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/u1hvfXTqebq6Na5zhzHiJYZT0YK.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2004-09-22",
                    "episode_count": 24,
                    "id": 14041,
                    "name": "Season 1",
                    "overview": "Mysteries abound on the first season of LOST as the survivors of Oceanic Air flight 815 find themselves stranded on an unidentified island with little hope of rescue.",
                    "poster_path": "/fc9f4ERC09U1GziCgDWilWWgjKx.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2005-09-21",
                    "episode_count": 24,
                    "id": 14042,
                    "name": "Season 2",
                    "overview": "The second season of the American serial drama television series Lost commenced airing in the United States and Canada on September 21, 2005 and concluded on May 24, 2006. The second season continues the stories of a group of over forty people who have been stranded on a remote island in the south Pacific, after their airplane crashed forty-four days prior to the beginning of the season. The producers have stated that as the first season is about introducing the survivors, the second season is about a 1970s scientific Dharma Initiative research station which the survivors discovered on the island and refer to as \"the hatch\". The second season aired Wednesdays at 9:00 pm in the United States. In addition to the regular twenty-four episodes, three clip-shows recapped previous events on the show. \"Destination Lost\" aired before the premiere, \"Lost: Revelation\" aired before the tenth episode and \"Lost: Reckoning\" aired before the twentieth episode. The season was released on DVD as a seven disc boxed set under the title of Lost: The Complete Second Season - The Extended Experience on September 5, 2006 by Buena Vista Home Entertainment.",
                    "poster_path": "/vGLddXoXJhKPsAWeDYbAsE4wW1z.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2006-10-04",
                    "episode_count": 23,
                    "id": 14043,
                    "name": "Season 3",
                    "overview": "The third season of the American serial drama television series Lost commenced airing in the United States and Canada on October 4, 2006 and concluded on May 23, 2007. The third season continues the stories of a group of over 40 people who have been stranded on a remote island in the South Pacific, after their airplane crashed 68 days prior to the beginning of the season. In the Lost universe, the season takes place from November 28 to December 21, 2004. The producers have stated that as the first season is about introducing the survivors and the second season is about the hatch, the third season is about the Others, a group of mysterious island inhabitants.\n\nIn response to fan complaints about scheduling in the previous seasons, ABC decided to air the episodes without reruns, albeit in two separate blocks. In the United States, the first block consisted of six episodes aired on Wednesdays at 9:00 pm and after a twelve week break, the season continued with the remaining 16 episodes at 10:00 pm. In addition, three clip-shows recapped previous events on the show. \"Lost: A Tale of Survival\" aired a week before the season premiere, \"Lost Survivor Guide\" aired before the seventh episode and \"Lost: The Answers\" aired before the season finale Buena Vista Home Entertainment released the season under the title Lost: The Complete Third Season - The Unexplored Experience on December 11, 2007 in Region 1 on DVD and Blu-ray Disc.",
                    "poster_path": "/zLnuh6DVyrz5iaNVO6KNKubtffo.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2008-01-31",
                    "episode_count": 14,
                    "id": 14044,
                    "name": "Season 4",
                    "overview": "The fourth season of the American serial drama television series Lost commenced airing on the American Broadcasting Company Network in the United States, and on CTV in Canada on January 31, 2008 and concluded on May 29, 2008. The season continues the stories of a group of over 40 people who have been stranded on a remote island in the South Pacific, after their airplane crashed there more than 90 days prior to the beginning of the season. According to Lost's executive producers/writers/showrunners Damon Lindelof and Carlton Cuse, there are two main themes in fourth season: \"the castaways' relationship to the freighter folk\" and \"who gets off the island and the fact that they need to get back\". Lost came under scrutiny from critics in its third season, but the fourth season was acclaimed for its flash-forwards, pace and new characters.\n\nThe season was originally planned to contain 16 episodes; eight were filmed before the start of the 2007-2008 Writers Guild of America strike. Following the strike's resolution, it was announced that only five more episodes would be produced to complete the season; however, the season finale's script was so long that network executives approved the production of a 14th episode as part of a three-hour season finale split over two nights. The fourth season aired Tuesdays at 9:00 pm from January 31 to March 20, 2008 and at 10:00 pm from April 24 to May 15, 2008. The two-hour finale aired at 9:00 pm on May 29, 2008. Buena Vista Home Entertainment released the season on DVD and Blu-ray Disc under the title Lost: The Complete Fourth Season - The Expanded Experience on December 9, 2008 in Region 1; however, it was released earlier—on October 20, 2008—in Region 2.",
                    "poster_path": "/TOfSxtW76sWrPn3YSm5GooaR3Y.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2009-01-21",
                    "episode_count": 17,
                    "id": 14045,
                    "name": "Season 5",
                    "overview": "The fifth season of the American serial drama television series Lost commenced airing on the ABC network in the United States and on A in Canada in January 2009, and concluded with a two-hour season finale on May 13, 2009. The season continues the stories of the survivors of the fictional crash of Oceanic Airlines Flight 815, after some of them are rescued and those still stranded seemingly disappear to an unknown location and time with the island that they inhabit.\n\nAccording to Lost's co-creator/executive producer/writer/show runner Damon Lindelof, the season \"is about why [the people who have left the island] need to get back\". Lost returned on January 21, 2009 on ABC with a three-hour premiere consisting of a clip-show and two back-to-back new episodes. The remainder of the season aired on Wednesdays at 9:00 pm EST. The season began in the UK and Ireland on January 25, 2009 on Sky1 and RTÉ Two, respectively. The season was released on DVD and Blu-ray Disc under the title Lost: The Complete Fifth Season - The Journey Back, Expanded Edition on December 8, 2009.",
                    "poster_path": "/2OYKA6UIC56loPxgL4IMshg4mVr.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2010-02-02",
                    "episode_count": 18,
                    "id": 14046,
                    "name": "Season 6",
                    "overview": "After Season 5’s explosive finish, everything is up in the air for the survivors of flight 815. No one knows what — or who — the future will hold. Will Juliet’s sacrifice to save her friends work? Can Kate choose, once and for all, between Jack and Sawyer? Will Sun and Jin be reunited? Is it too late to save Claire? Whatever awaits everyone on the island, one thing is for certain — the moment of truth has arrived.",
                    "poster_path": "/xUb57GiEwg6pJpU4F3e01PKRVlc.jpg",
                    "season_number": 6
                }
            ],
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy",
                "Mystery",
                "Sci-Fi",
                "Thriller"
            ],
            "poster": "/og6S0aTZU6YUJAbqxeKjCa3kY1E.jpg"
        },
        {
            "creator": "Carter Bays",
            "title": "How I Met Your Mother",
            "nos": 9,
            "year": "2005-2014",
            "rating": "TV-14",
            "imdb": "8.3",
            "rt": 0,
            "awards": "Won 10 Primetime Emmys. 26 wins & 95 nominations total",
            "desc": "A father recounts to his children - through a series of flashbacks - the journey he and his four best friends took leading up to him meeting their mother.",
            "stars": "Josh Radnor, Jason Segel, Cobie Smulders",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2006-11-20",
                    "episode_count": 11,
                    "id": 3613,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/ggQEDWguo6CVctkLKMFcOXzEQxR.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2005-09-19",
                    "episode_count": 22,
                    "id": 3607,
                    "name": "Season 1",
                    "overview": "In the year 2030, Ted Mosby (voiced by Bob Saget) sits his children down to tell them the story of how he met their mother.",
                    "poster_path": "/pC6SDAf0Vvcx6NLTxx78NlCPtW9.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2006-09-18",
                    "episode_count": 22,
                    "id": 3608,
                    "name": "Season 2",
                    "overview": "Ted and Robin are now a couple; meanwhile, a heartbroken Marshall tries to continue his life without Lily.",
                    "poster_path": "/gsQZtJgLmsCeepzWrQZ32CUQpxn.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2007-09-24",
                    "episode_count": 20,
                    "id": 3609,
                    "name": "Season 3",
                    "overview": "Barney begins the season with the word, \"-dary!\" Robin returns from a trip to Argentina with her new boyfriend, Gael (Enrique Iglesias), and Ted must adjust to life as just her friend, while watching Robin and Gael fawning over each other.",
                    "poster_path": "/eAKwxhNJynTiBi2FcLIbgypYivi.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2008-09-22",
                    "episode_count": 24,
                    "id": 3610,
                    "name": "Season 4",
                    "overview": "Stella says yes to Ted's proposal. Robin takes a new job in Japan, but quickly resigns and returns to New York to attend Ted's wedding, after realizing how much she misses her friends.",
                    "poster_path": "/eRZKD5EzVZ8e1ZaADylVzPuPbM0.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2009-09-21",
                    "episode_count": 24,
                    "id": 3611,
                    "name": "Season 5",
                    "overview": "Ted begins his job as a professor of architecture, standing in the middle of a classroom - although the mother was present, it turns out to be an economics class as he's in the wrong lecture hall.",
                    "poster_path": "/mcpb3gsBjqIgXRaMvOqoqEbnf8d.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2010-09-20",
                    "episode_count": 24,
                    "id": 3612,
                    "name": "Season 6",
                    "overview": "Ted sees Cindy again with a girl who he thinks to be her roommate, but she turns out to be Cindy's girlfriend whom she later marries.",
                    "poster_path": "/n1kRegqvMCkT6jlc35SZZeusEtJ.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2011-09-19",
                    "episode_count": 24,
                    "id": 3614,
                    "name": "Season 7",
                    "overview": "Ted is helping Barney get ready for his wedding to a still-unknown bride.",
                    "poster_path": "/z6z5t33Dn93mloXa8lIkwqgZ0Qh.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2012-09-24",
                    "episode_count": 24,
                    "id": 3615,
                    "name": "Season 8",
                    "overview": "Ted visits Robin on the day of her wedding to Barney, causing him to remember how he and Victoria ran away from her wedding to be together.",
                    "poster_path": "/q4g25dFhEwXiHSvOa4qQbgByNTv.jpg",
                    "season_number": 8
                },
                {
                    "air_date": "2013-09-23",
                    "episode_count": 24,
                    "id": 3616,
                    "name": "Season 9",
                    "overview": "With the exception of the last episode, the entirety of season nine takes place in the 56 hours leading up to Barney and Robin's wedding.",
                    "poster_path": "/ez6pjmvnZpdfowSlGfEJFsNZLBQ.jpg",
                    "season_number": 9
                }
            ],
            "genres": [
                "Comedy",
                "Romance"
            ],
            "poster": "/dvxSvr6OmYGvvt8Z1VdBlPfL1Lf.jpg"
        },
        {
            "creator": "Jonathan Nolan",
            "title": "Person of Interest",
            "nos": 5,
            "year": "2011-2016",
            "rating": "TV-14",
            "imdb": "8.4",
            "rt": 0,
            "awards": "Nominated for 1 Primetime Emmy. Another 9 wins & 21 nominations.",
            "desc": "An ex-CIA agent and a wealthy programmer save lives via a surveillance AI that sends them the identities of civilians involved in impending crimes. However, the details of the crimes, including the civilians' roles, are left a mystery.",
            "stars": "Jim Caviezel, Kevin Chapman, Michael Emerson, Amy Acker",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2011-09-22",
                    "episode_count": 2,
                    "id": 3695,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/A7ugDMjnvC117VcYWBtizfjZiHW.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2011-09-22",
                    "episode_count": 23,
                    "id": 3693,
                    "name": "Season 1",
                    "overview": "A supercomputer developed by reclusive billionaire and software genius Harold Finch analyzes data patterns in surveillance for the U.S. government to identify impending acts of terrorism. But the computer, known only as \"The Machine\", can also identify ordinary people who are about to be involved in violent crimes. Can those crimes be stopped before they take place? Secretly tapping into The Machine, Finch and ex-CIA agent John Reese use vigilante tactics and state-of-the-art technology to identify the soon-to-be victims and prevent the crimes from occuring. Meanwhile, two NYPD detectives Joss Carter and Lionel Fusco are drawn into the cases and the mystery surrounding the two covert crime fighters.",
                    "poster_path": "/8RZZOcygHWe6A2yNr9YumbpkC3R.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2012-09-27",
                    "episode_count": 22,
                    "id": 3694,
                    "name": "Season 2",
                    "overview": "The Machine identifies another gripping season's worth of potential crimes that must be stopped. Adversaries from Reese's undercover past and Finch's government work threaten the team's crime-fighting mission and anonymity. Meanwhile, Detectives Carter and Fusco face down FBI probes and the dangerous tentacles of the police conspiracy known as \"HR\".",
                    "poster_path": "/dNutl6N1mEq12ugZlLt0tGeuqmE.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2013-09-24",
                    "episode_count": 23,
                    "id": 3696,
                    "name": "Season 3",
                    "overview": "The team suffers a devastating loss and confront staggering challenges. Adapting to the next evolution of The Machine, now completely self-governed and hidden from all, Finch and Reese team with rogue agent Sameen Shaw to save lives and seek justice, but their missions now threaten to tear them apart. Joss Carter and Lionel Fusco finally unravel the criminal police conspiracy \"HR\" - but at a tragic cost. And former cyber-enemy — and now highly tuned confederate of The Machine — Root becomes an unpredictable ally when the team learns a second surveillance apparatus to rival The Machine is on the verge of activation.",
                    "poster_path": "/7Zf7tpmo7BovQJ028v1T9dZLHca.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2014-09-23",
                    "episode_count": 22,
                    "id": 62021,
                    "name": "Season 4",
                    "overview": "Although they’ve saved countless lives thanks to The Machine’s omniscience, John Reese and Harold Finch, along with lethal operative Sameen Shaw and unpredictable cyber-hacker Root now face an uncertain future. With a second machine — Samaritan — now online, the elusive team are now targets themselves, hiding in plain sight. The only thing more frightening than the ruthless Decima organization calling the shots is leaving those decisions up to an untested Machine. Facing a dangerous tomorrow, the POI team must find a way to outsmart Samaritan, an all-seeing, all-powerful artificial intelligence that’s self-governing, continually evolving and growing stronger every day.",
                    "poster_path": "/zDaDWGASTt6WxfFp5LHF9zb6poV.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2016-05-03",
                    "episode_count": 13,
                    "id": 70251,
                    "name": "Season 5",
                    "overview": "For years, the Person of Interest team have been protected by The Machine, but as worlds collided and a rival AI known as Samaritan finally cornered The Machine inside the nation’s power grid, it was the POI team’s turn to protect Finch’s creation. In season five, the cold war is over. The world around us might look the same, but something has drastically changed. Samaritan’s lethal “correction” has initiated its control. Finch’s Machine is essentially dead. Shaw is still missing. And the team is once again hiding in plain sight. But with Samaritan’s invisible grip tightening everywhere, will Finch be able to rebuild and resurrect The Machine? And if he does, will it be the same Machine when it comes back online?",
                    "poster_path": "/tgZomLBDtGI8UAUijhz7MEFAjts.jpg",
                    "season_number": 5
                }
            ],
            "genres": [
                "Action",
                "Crime",
                "Drama",
                "Mystery",
                "Sci-Fi",
                "Thriller"
            ],
            "poster": "/nzWdHTq53KMQFphullKFaVi6252.jpg"
        },
        {
            "creator": "Eric Kripke",
            "title": "Supernatural",
            "nos": 15,
            "year": "2005-2020",
            "rating": "TV-14",
            "imdb": "8.4",
            "rt": 0,
            "awards": "Nominated for 3 Primetime Emmys. 37 wins & 126 nominations total",
            "desc": "Two brothers follow their father's footsteps as hunters, fighting evil supernatural beings of many kinds, including monsters, demons and gods that roam the earth.",
            "stars": "Jared Padalecki, Jensen Ackles, Jim Beaver",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": null,
                    "episode_count": 4,
                    "id": 6902,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/6VmmiImmxcspyjcm4qKLGVYlPh6.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2005-09-13",
                    "episode_count": 22,
                    "id": 6904,
                    "name": "Season 1",
                    "overview": "The Creepy. The Demented. The Unexplained. The Unearthly. Sam Winchester grew up hunting such terrifying things. But that’s all past. Law school beckons him. So does safety and normalcy. That is, until Sam’s estranged brother Dean appears with troubling news: their father has disappeared, a man who’s hunted evil for 22 years. So to find their father, the brothers must hunt what their father hunts…and Sam must return to the life he’d rather leave behind.",
                    "poster_path": "/f4NzMUpOqwzut7jML4IUZcHqkLt.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2006-09-28",
                    "episode_count": 22,
                    "id": 6905,
                    "name": "Season 2",
                    "overview": "They're back the ghouls and vampires, the ghosts and spirits and even more terrifying entities. And wherever these evil beings are, you'll find brothers Sam and Dean Winchester, hunters on the trail of the demon who murdered their mother…and of any other unholy agent of the Supernatural. Join the brothers in their mind-bending, bone-chilling Season 2 road trip across America a journey deeper into the mystery of their own destinies.",
                    "poster_path": "/O1xXxsAWiCWrw5eMmGCs1JpFNY.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2007-10-04",
                    "episode_count": 16,
                    "id": 6906,
                    "name": "Season 3",
                    "overview": "The yellow-eyed demon is vanquished, but at a terrible price. The battle that brought him down released hundreds of demons from Hell into an unsuspecting world. And it cost Sam his life. But a grief-stricken Dean made a deal with the Crossroad Demon: his soul for Sam's resurrection. Now Dean has just one year to live. One year to fight the unholy, the twisted, the ghoulish. One year to say farewell to Sam. And one year for Sam to search desperately for some way to save his brother. Mind-bending adventure awaits as the Winchester brothers continue their astonishing odyssey into the supernatural...and their personal odyssey into destiny.",
                    "poster_path": "/owiz98MIJInep0eOd4io97p69UO.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2008-09-18",
                    "episode_count": 22,
                    "id": 6907,
                    "name": "Season 4",
                    "overview": "Resurrection. After enduring unspeakable torture, Dean escapes from Hell, rescued by an all-powerful creature he's never seen before an Angel a warrior of God who recruits Sam and Dean in Heaven's battle against Hell. And there are whispers that a certain fallen angel will soon be freed from his prison deep in Hell: Lucifer. If Sam and Dean can't stop it if Lucifer walks free he'll bring on the Apocalypse. Meanwhile, the Winchester brothers reunite and hit the road, battling the supernatural wherever they go. They encounter demons, spirits, Dracula himself and even a drunk, heavily armed seven-foot-tall teddy bear. All the while, the ultimate war draws them into its horror. Caught between Heaven and Hell, between God and the Devil, the Winchester brothers must battle for the future of humankind.",
                    "poster_path": "/2FGxAP0zwgTZjK6Ev22sox1yIKH.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2009-09-10",
                    "episode_count": 22,
                    "id": 6908,
                    "name": "Season 5",
                    "overview": "Two brothers and one fallen angel - against all the might of Satan and his army! As the Apocalypse grows closer, threatening to turn Earth into a battlefield soaked with human blood, Sam, Dean and Castiel struggle against daunting odds. New foes arise, including the Four Horsemen of the Apocalypse. Old friends depart, consumed by the fearsome wrath of Hell. Through it all, the Winchesters are targeted by demons and angels alike, who warn that each brother has a special and terrible role to play in the coming devastation. Season Five follows Sam and Dean on their most terrifying journey yet, one that may lead them to the only ally strong enough to defeat the Devil: God.",
                    "poster_path": "/g0pAERtcvBwqDvFxfDbBPzfHoyQ.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2010-09-24",
                    "episode_count": 22,
                    "id": 6909,
                    "name": "Season 6",
                    "overview": " The prize: ending the Apocalypse. The price: Sam's life. Season 5's horrific finale left Dean alone, as Sam descended into Hell. Now a different man, Dean vows to stop hunting and devote himself to building a family with Lisa and her son Ben. Then, mysteriously, Sam reappears, drawing Dean back into the old life. But Sam's a different man too. He's returned without his soul. How the Winchesters confront this greatest challenge yet to their powerful bond is the troubled heart - and soul - of the profound and thrilling 22-Episode Season 6. As the brothers struggle to reunite, they must also battle deadly supernatural forces. Demons. Angels. Vampires. Shapeshifters. And a terrifying new foe called the Mother of All.",
                    "poster_path": "/4jEVEZiuJa023ZzcI0mutle6eND.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2011-09-23",
                    "episode_count": 23,
                    "id": 6910,
                    "name": "Season 7",
                    "overview": " In Season 7, Sam and Dean fight demons. Real demons, like Lucifer, who tortures Sam with visions of Hell. Private demons, as the brothers face a traumatic personal loss when Bobby is cut down by alien forces. And as Sam and Dean travel the back roads of America, hunting monsters who wreak havoc on the innocent, a new and more terrible foe hunts them: Leviathans, freed from Purgatory and immune to the brothers' arsenal of weapons and cunning. With Bobby gone, all Sam and Dean can rely on is each other. But will that be enough?",
                    "poster_path": "/hkgRHa2fjySdj6gA8VLHQrxUfiP.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2012-10-03",
                    "episode_count": 23,
                    "id": 6911,
                    "name": "Season 8",
                    "overview": "After a year apart, Sam and Dean are reunited in the Eighth Season premiere. After escaping from Purgatory with the help of a vampire named Benny, Dean heads straight for Sam, but the reunion isn't exactly everything he imagined it would be. Although Sam drops everything to join his brother, leaving the life he had grown accustomed to enjoy turns out to be harder than he imagined. In the meantime, Benny’s help turns out to be more than what Dean bargained for. As the brothers struggle with their unexpected reunion, they make a shocking discovery that could lead them on a deeply personal mission to settle old scores. If only they could agree - is this a “family business” or isn’t it?",
                    "poster_path": "/16gx7PmtzXHadQfW9Y9GGQZS3T9.jpg",
                    "season_number": 8
                },
                {
                    "air_date": "2013-10-08",
                    "episode_count": 23,
                    "id": 6903,
                    "name": "Season 9",
                    "overview": " After defeating the Leviathan, Sam and Dean set off on an epic quest to seal the Gates of Hell last season. Facing a series of trials, the Winchesters soon found themselves in the middle of an age-old power struggle between the King of Hell and legions of warrior angels. But with the angels cast out of heaven and walking the earth, things just got very unpredictable.",
                    "poster_path": "/5f2mRNqKFgtV5AWnC0OSIkYbzw0.jpg",
                    "season_number": 9
                },
                {
                    "air_date": "2014-10-07",
                    "episode_count": 23,
                    "id": 62088,
                    "name": "Season 10",
                    "overview": "Season 10 begins with Sam’s frantic search for his missing brother, who is gone without a trace. The road to recovering the wayward Dean takes Sam down dark paths, with consequences that will shake the boys to their core. Meanwhile, Castiel has to pick up the pieces in the aftermath of Metatron’s campaign. With his grace failing and rogue angels still on the loose, Cas will face the ticking clock of his own mortality as all-new threats emerge to once again push all of our heroes to their limits.",
                    "poster_path": "/y9Q90gjBX820NZw59O8HWlkZOek.jpg",
                    "season_number": 10
                },
                {
                    "air_date": "2015-10-07",
                    "episode_count": 23,
                    "id": 70169,
                    "name": "Season 11",
                    "overview": "Following the release of the Darkness, this season follows the Winchesters and their allies as they find themselves fighting the most powerful supernatural entity they've ever faced.",
                    "poster_path": "/2RlcVP4LsRzr1g8oIU3hNq0BEwm.jpg",
                    "season_number": 11
                },
                {
                    "air_date": "2016-10-13",
                    "episode_count": 23,
                    "id": 78350,
                    "name": "Season 12",
                    "overview": "In the show's eleventh season, the Winchesters found themselves battling an apocalyptic force: the Darkness. Now, rallying help from their allies - both human and supernatural - Sam and Dean are about to go toe-to-toe with the most destructive enemy they've ever seen. The question is, will they win? And at what price?",
                    "poster_path": "/bbXz9rxZr7nCpqD0OOWgTIPvRoH.jpg",
                    "season_number": 12
                },
                {
                    "air_date": "2017-10-12",
                    "episode_count": 23,
                    "id": 92695,
                    "name": "Season 13",
                    "overview": "Season 13 begins exactly where we left off, with Sam and Dean left to pick up the pieces after the loss of their mother, the demise of Crowley and the heartbreaking death of Castiel. The birth of Jack leaves the Winchester brothers with differing opinions on how to deal with a Nephilim. After being dragged into the breach, Mary must learn to survive Lucifer and an apocalyptic world.",
                    "poster_path": "/xBJ7Ts2nDUbUWu4Ef9v086dbBrQ.jpg",
                    "season_number": 13
                },
                {
                    "air_date": "2018-10-11",
                    "episode_count": 20,
                    "id": 105970,
                    "name": "Season 14",
                    "overview": "",
                    "poster_path": "/aDjwpaTK3cVv1KG3RlahEhy4KCq.jpg",
                    "season_number": 14
                },
                {
                    "air_date": "2019-10-10",
                    "episode_count": 20,
                    "id": 132243,
                    "name": "Season 15",
                    "overview": "",
                    "poster_path": "/f07SeTOGTcWMGsc2bhlDAASBd4H.jpg",
                    "season_number": 15
                }
            ],
            "genres": [
                "Drama",
                "Fantasy",
                "Horror"
            ],
            "poster": "/KoYWXbnYuS3b0GyQPkbuexlVK9.jpg"
        },
        {
            "creator": "Mark Fergus",
            "title": "The Expanse",
            "nos": 5,
            "year": "2015-",
            "rating": "TV-14",
            "imdb": "8.5",
            "rt": 0,
            "awards": "3 wins & 24 nominations",
            "desc": "In the 24th century, a disparate band of antiheroes unravel a vast conspiracy that threatens the Solar System's fragile state of cold war.",
            "stars": "Wes Chatham, Dominique Tipper, Steven Strait",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2015-12-14",
                    "episode_count": 49,
                    "id": 73651,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/yljPb9oyOccXWZEQqL5Kj1XJdyQ.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2015-12-14",
                    "episode_count": 10,
                    "id": 69635,
                    "name": "Season 1",
                    "overview": "In season one, the disappearance of rich-girl-turned-political-activist Julie Mao linked the lives of Ceres' detective Joe Miller, accidental ship captain James Holden and U.N. politician Chrisjen Avasarala. Amidst political tension between Earth, Mars and the Asteroid Belt, these three individuals unravel the single greatest conspiracy of all time.",
                    "poster_path": "/mVifh8MrY1xVhTnfnONYn8JMSut.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2017-02-01",
                    "episode_count": 13,
                    "id": 79720,
                    "name": "Season 2",
                    "overview": "Season 2 kicks off with interplanetary tensions at an all-time high, the cold war between Earth and Mars is on the brink of an all-out battle.",
                    "poster_path": "/nOQ1GMlMuVhH0fcI1fcEP2WQk7K.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2018-04-11",
                    "episode_count": 13,
                    "id": 99857,
                    "name": "Season 3",
                    "overview": "As the Rocinante crew digs deeper into the search for Prax's missing daughter, the war between Earth and Mars turns deadly in ways the solar system has never seen. But a new threat in the outer reaches of the Belt could prove much more dangerous, threatening to test the very future of humanity.",
                    "poster_path": "/irqtvxTFbjlIvgPNtG0EZwqTPrC.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2019-12-13",
                    "episode_count": 10,
                    "id": 110408,
                    "name": "Season 4",
                    "overview": "With the Ring Gates now open to thousands of new planets, a blood-soaked gold rush begins, igniting new conflicts between Earth, Mars, and the Belt. Meanwhile, on one unexplored planet, the Rocinante crew gets caught in a violent clash between an Earth mining corporation and desperate Belter settlers as deadly, new threats from the protomolecule emerge.",
                    "poster_path": "/8ngLHIIL0POcb0wXHFwyIz8QRRL.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2020-12-16",
                    "episode_count": 10,
                    "id": 165228,
                    "name": "Season 5",
                    "overview": "In different parts of the Solar System, the crew of the Rocinante and their allies confront the sins of their past, while Marco Inaros unleashes an attack that will alter the future of Earth, Mars, the Belt, and the worlds beyond the Ring.",
                    "poster_path": "/aiGapvUmuErjFochQMB3axeb7OZ.jpg",
                    "season_number": 5
                }
            ],
            "genres": [
                "Drama",
                "Mystery",
                "Sci-Fi"
            ],
            "poster": "/5vQlVWkIMPhZ88OWchJsgwGEK9.jpg"
        },
        {
            "creator": "Mike Judge",
            "title": "Silicon Valley",
            "nos": 6,
            "year": "2014-2019",
            "rating": "TV-MA",
            "imdb": "8.5",
            "rt": 0,
            "awards": "Won 2 Primetime Emmys. Another 13 wins & 94 nominations.",
            "desc": "Follows the struggle of Richard Hendricks, a Silicon Valley engineer trying to build his own company called Pied Piper.",
            "stars": "Thomas Middleditch, Josh Brener, Martin Starr, Kumail Nanjiani",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2014-04-06",
                    "episode_count": 5,
                    "id": 136204,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/nCBfoDu1ovSSkxIWPZz3lbFb9Dk.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2014-04-06",
                    "episode_count": 8,
                    "id": 59905,
                    "name": "Season 1",
                    "overview": "Introverted programmer Richard and his pals are going nowhere fast--until his website's unique search algorithm becomes the subject of an extreme bidding war.",
                    "poster_path": "/hRAfu6K3s4CLyQwRIWCnIbMjASn.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2015-04-12",
                    "episode_count": 10,
                    "id": 64396,
                    "name": "Season 2",
                    "overview": "After taking the tech world by storm with their debut at TechCrunch Disrupt last season, Richard and his Pied Piper team look ahead to a big future--one that's immediately soured by legal woes and petty revenge plans from Hooli overlord Gavin Belson. This season, Monica finds herself torn between her allegiance to Richard and her job working under a new head honcho. Meanwhile, the presence of Richard's departed longtime pal Big Head looms large, as Gavin decides to use him to his fullest potential.",
                    "poster_path": "/bzz8eBRsin3skOjd5fzrOkVYJAv.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2016-04-24",
                    "episode_count": 10,
                    "id": 74544,
                    "name": "Season 3",
                    "overview": "With Richard unexpectedly ousted as CEO, Season 3 picks up with him offered a diminished role of CTO and the rest of his team facing the question of just how far their loyalty extends. Now under a new CEO who is hell-bent on transforming everything from Pied Piper's offices to its business agenda, the guys must find a way to triumph in the war of Art vs. Commerce. Meanwhile, as Gavin Belson works to rehabilitate Hooli's image following his blunders, Big Head finds himself in a new partnership.",
                    "poster_path": "/m9B0FRaPf2AxsxWV3fYwZpIF5Be.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2017-04-23",
                    "episode_count": 10,
                    "id": 84905,
                    "name": "Season 4",
                    "overview": "Change is in the air in Season 4 as the Pied Piper guys pursue their video-chat app, PiperChat, but Richard has a hard time letting go of his dream to put his algorithm to better use, leaving the team struggling with how they fit into the picture. Meanwhile, Monica deals with new competition in the office, and Gavin faces big changes at Hooli and beyond.",
                    "poster_path": "/lsYfCqNCWWTc7zsqO5MYcptJI0n.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2018-03-25",
                    "episode_count": 8,
                    "id": 97737,
                    "name": "Season 5",
                    "overview": "Pied Piper finally has enough funding for proper offices and new employees, and to bring its peer-to-peer internet to the world - but leveling up introduces a whole new class of obstacles. While Richard struggles to lead a larger team and play with the big dogs, the rest of the team adjusts to new staff, new digs and new anxieties. Meanwhile, Hooli rival Gavin Belson has returned to power, but finds the threat of Pied Piper, and its boldness, hard to shake.",
                    "poster_path": "/2vlduWj0PFwwQT4AAZMJYvzOof6.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2019-10-27",
                    "episode_count": 7,
                    "id": 130106,
                    "name": "Season 6",
                    "overview": "",
                    "poster_path": "/x051lTdH0cNR4NJeB3UJwofqYN8.jpg",
                    "season_number": 6
                }
            ],
            "genres": [
                "Comedy"
            ],
            "poster": "/a154rIMzbTyefodNp4NY8qjOEfC.jpg"
        },
        {
            "creator": "Bruce Miller",
            "title": "The Handmaid's Tale",
            "nos": 4,
            "year": "2017-",
            "rating": "TV-MA",
            "imdb": "8.4",
            "rt": 0,
            "awards": "Won 15 Primetime Emmys. 75 wins & 183 nominations total",
            "desc": "Set in a dystopian future, a woman is forced to live as a concubine under a fundamentalist theocratic dictatorship.",
            "stars": "Elisabeth Moss, Yvonne Strahovski, Joseph Fiennes",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2018-04-25",
                    "episode_count": 36,
                    "id": 125495,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 0
                },
                {
                    "air_date": "2017-04-26",
                    "episode_count": 10,
                    "id": 83562,
                    "name": "Season 1",
                    "overview": "Season One Offred must navigate between Commanders, their cruel Wives, domestic Marthas, and her fellow Handmaids - where anyone could be a spy for Gilead - with one goal: to survive and find the daughter who was taken from her.",
                    "poster_path": "/Q6Kgm3SgFC5krNiwP4N8tUPtSP.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2018-04-25",
                    "episode_count": 13,
                    "id": 93574,
                    "name": "Season 2",
                    "overview": "Season two is shaped by Offred’s pregnancy and her ongoing fight to free her future child from the dystopian horrors of Gilead. “Gilead is within you” is a favorite saying of Aunt Lydia and in this season, Offred and all our characters will fight against - or succumb to - this dark truth.",
                    "poster_path": "/szTXwJyWKVKgmWLvhtdQsSeadRZ.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2019-06-05",
                    "episode_count": 13,
                    "id": 118751,
                    "name": "Season 3",
                    "overview": "Season three is driven by June's resistance to the dystopian regime of Gilead and her struggle to strike back against overwhelming odds. Startling reunions, betrayals, and a journey to the terrifying heart of Gilead force all characters to take a stand, guided by one defiant prayer: \"Blessed be the fight.\"",
                    "poster_path": "/rPPO245EX4ppyLjk21N4I0foICX.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2021-04-28",
                    "episode_count": 10,
                    "id": 183340,
                    "name": "Season 4",
                    "overview": "June strikes back against Gilead as a fierce rebel leader, but the risks she takes bring unexpected and dangerous new challenges. Her quest for justice and revenge threatens to consume her and destroy her most cherished relationships.",
                    "poster_path": "/oIkxqt6ug5zT5ZSUUyc1Iqopf02.jpg",
                    "season_number": 4
                }
            ],
            "genres": [
                "Drama",
                "Sci-Fi",
                "Thriller"
            ],
            "poster": "/oIkxqt6ug5zT5ZSUUyc1Iqopf02.jpg"
        },
        {
            "creator": "Steve Lightfoot",
            "title": "The Punisher",
            "nos": 2,
            "year": "2017-2019",
            "rating": "TV-MA",
            "imdb": "8.5",
            "rt": 0,
            "awards": "Nominated for 1 Primetime Emmy. Another 1 win & 13 nominations.",
            "desc": "After the murder of his family, Marine veteran Frank Castle becomes the vigilante known as \"The Punisher,\" with only one goal in mind: to avenge them.",
            "stars": "Jon Bernthal, Amber Rose Revah, Ben Barnes, Jason R. Moore",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2017-11-17",
                    "episode_count": 13,
                    "id": 78693,
                    "name": "Season 1",
                    "overview": "A former Marine out to punish the criminals responsible for his family's murder finds himself ensnared in a military conspiracy.",
                    "poster_path": "/pJHS0WCBIOPJMIYpGQwubSBvDa.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2019-01-18",
                    "episode_count": 13,
                    "id": 115281,
                    "name": "Season 2",
                    "overview": "Frank strives to protect a teenager caught in a sinister conspiracy while doing whatever it takes -- and then some -- to end Russo once and for all.",
                    "poster_path": "/5dPQJwvAEXMbwC1fPc6GV578LS3.jpg",
                    "season_number": 2
                }
            ],
            "genres": [
                "Action",
                "Crime",
                "Drama",
                "Thriller"
            ],
            "poster": "/s2YM9zHF3tf2coi8t0UEzYrOHg8.jpg"
        },
        {
            "creator": "Sam Esmail",
            "title": "Mr. Robot",
            "nos": 4,
            "year": "2015-2019",
            "rating": "TV-MA",
            "imdb": "8.5",
            "rt": 0,
            "awards": "Won 3 Primetime Emmys. 21 wins & 82 nominations total",
            "desc": "Elliot, a brilliant but highly unstable young cyber-security engineer and vigilante hacker, becomes a key figure in a complex game of global dominance when he and his shadowy allies try to take down the corrupt corporation he works f",
            "stars": "Rami Malek, Christian Slater, Carly Chaikin",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2016-06-20",
                    "episode_count": 18,
                    "id": 77843,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/7MQ8tnk0Ne2uZRLDYrVUbJwpAh1.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2015-06-24",
                    "episode_count": 10,
                    "id": 66343,
                    "name": "season_1.0",
                    "overview": "Elliot finds himself at a crossroad when the mysterious leader of an underground hacker group recruits him to destroy the firm he is paid to protect. Compelled by his personal beliefs, Elliot struggles to resist the chance to take down the multinational CEOs he believes are running (and ruining) the world.",
                    "poster_path": "/1aiNh5Gak36EdpdwhvWHIXzAj50.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2016-07-13",
                    "episode_count": 12,
                    "id": 75658,
                    "name": "season_2.0",
                    "overview": "Following the events of fsociety’s 5/9 hack on multi-national company Evil Corp, season two explores the consequences of that attack as well as the illusion of control.",
                    "poster_path": "/kQKqOLDiwpf8VNGrZSCfw7gRj0Q.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2017-10-11",
                    "episode_count": 10,
                    "id": 91537,
                    "name": "season_3.0",
                    "overview": "Picking up immediately following the season two cliffhanger, season three explores each character’s motivations and the disintegration between Elliot and Mr. Robot.",
                    "poster_path": "/AmRhiyXwFvcoqm8DpZCPkFs6vqK.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2019-10-06",
                    "episode_count": 13,
                    "id": 131086,
                    "name": "season_4.0",
                    "overview": "Goodbye, friend.",
                    "poster_path": "/4PxMbpF3pv5B8eYw48hZ1hy16gr.jpg",
                    "season_number": 4
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Thriller"
            ],
            "poster": "/oKIBhzZzDX07SoE2bOLhq2EE8rf.jpg"
        },
        {
            "creator": "Aaron Korsh",
            "title": "Suits",
            "nos": 9,
            "year": "2011-2019",
            "rating": "TV-14",
            "imdb": "8.5",
            "rt": 0,
            "awards": "1 win & 9 nominations",
            "desc": "On the run from a drug deal gone bad, brilliant college dropout Mike Ross finds himself working with Harvey Specter, one of New York City's best lawyers.",
            "stars": "Gabriel Macht, Patrick J. Adams, Meghan Markle",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2012-06-07",
                    "episode_count": 30,
                    "id": 49019,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/agyP4DQE9Ny8kZDc3hvaVoTxYgK.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2011-06-23",
                    "episode_count": 12,
                    "id": 49020,
                    "name": "Season 1",
                    "overview": "The story follows Mike Ross, a brilliant college dropout who is hired by Harvey Spector, New York City's top corporate lawyer as his associate attorney.",
                    "poster_path": "/tPocb9DO6yrc4jI1JznPAnpU9yj.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2012-06-14",
                    "episode_count": 16,
                    "id": 49021,
                    "name": "Season 2",
                    "overview": "As Harvey focuses on protecting Mike's position, Jessica deals with the fallout after the unexpected reappearance of her co-founding partner.",
                    "poster_path": "/tX555XUvxQr2GOtvoO9DbWjOHi3.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2013-07-16",
                    "episode_count": 16,
                    "id": 49022,
                    "name": "Season 3",
                    "overview": "Skilled corporate lawyer Harvey Specter and his associate Mike Ross continue their unusual partnership in this season of the smart courtroom drama.",
                    "poster_path": "/l06AVtM15euPMsSs5ACWJ16nRVf.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2014-06-11",
                    "episode_count": 16,
                    "id": 61103,
                    "name": "Season 4",
                    "overview": "In Season 4, Harvey and Mike find themselves on opposite sides of a corporate takeover battle that draws attention from the government.",
                    "poster_path": "/uYatRS9fSyk6tEQ7FVBpAk33F85.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2015-06-24",
                    "episode_count": 16,
                    "id": 67345,
                    "name": "Season 5",
                    "overview": "Harvey regroups in the wake of Donna's departure, Mike and Rachel edge closer to marriage, and Jessica continues to come to grips with her new life.",
                    "poster_path": "/1RBn11qOQ69ogHElDkVIxFaX3Tz.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2016-07-13",
                    "episode_count": 16,
                    "id": 77763,
                    "name": "Season 6",
                    "overview": "In the aftermath of the trial, Mike faces the realities of his situation while Jessica, Harvey and Louis grapple to contain the firm's vulnerability.",
                    "poster_path": "/nRahhqsva7Jc6lzvgfsGXDL5IxO.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2017-07-12",
                    "episode_count": 16,
                    "id": 90223,
                    "name": "Season 7",
                    "overview": "Now that Mike is officially recognized as a lawyer and has accepted Harvey’s offer to return to the firm, Season 7 will see the team back together again at Pearson Specter Litt - each dealing with their own struggles as they adjust to a new world order without Jessica .",
                    "poster_path": "/9j3YyzH3JO7ab8muthbLAvrDjY7.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2018-07-18",
                    "episode_count": 16,
                    "id": 98716,
                    "name": "Season 8",
                    "overview": "In the wake of two emotional departures, Harvey and the rest of Specter Litt face an infusion of ambitious new blood and chart a daring new course.",
                    "poster_path": "/9oWBFDTXC94gxE3BTmyZT3kQ54I.jpg",
                    "season_number": 8
                },
                {
                    "air_date": "2019-07-17",
                    "episode_count": 10,
                    "id": 123740,
                    "name": "Season 9",
                    "overview": "As the firm chafes under intense new oversight, each partner faces a reckoning -- and Mike Ross returns to square off against his old mentor, Harvey.",
                    "poster_path": "/imN5wUvcjFTO31tZTMP956WyuXr.jpg",
                    "season_number": 9
                }
            ],
            "genres": [
                "Comedy",
                "Drama"
            ],
            "poster": "/vQiryp6LioFxQThywxbC6TuoDjy.jpg"
        },
        {
            "creator": "John Wells",
            "title": "Shameless",
            "nos": 11,
            "year": "2011-2021",
            "rating": "TV-MA",
            "imdb": "8.5",
            "rt": 0,
            "awards": "Won 4 Primetime Emmys. Another 12 wins & 66 nominations.",
            "desc": "A scrappy, feisty, fiercely loyal Chicago family makes no apologies.",
            "stars": "William H. Macy, Ethan Cutkosky, Jeremy Allen White, Shanola Hampton",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2010-12-12",
                    "episode_count": 23,
                    "id": 45139,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/54bpsi8pjiU3t3y2j16hAxN8PvC.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2011-01-09",
                    "episode_count": 12,
                    "id": 45137,
                    "name": "Season 1",
                    "overview": "Frank goes missing and turns up in Toronto, tries without success to embrace sobriety, and bends the law to protect his disability checks. Fiona falls for Steve, a handsome player with a nice car, a fat wallet, and a big secret. Ian embraces his sexuality, much to the chagrin of his brainy brother Lip. Debbie goes too far at a child's birthday party. Monica shows up with an announcement about baby Liam.",
                    "poster_path": "/gJdT0Hm5nhoAnNkgWTh6Oxusvnq.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2012-01-08",
                    "episode_count": 12,
                    "id": 45138,
                    "name": "Season 2",
                    "overview": "Frank and Monica rekindle their self-destructive relationship after Frank's mother returns from prison to wreak havoc. Fiona is thrown for a loop when Steve returns from Rio with a surprise. Lip makes big changes in preparation for the arrival of his and Karen's baby. Karen and Sheila clash over Karen's new husband Jody, a good-hearted but weird guy she met in Sexaholics Anonymous. Ian tries to get into West Point. Debbie prepares for the onset of puberty. Kev and Veronica contemplate starting a family.",
                    "poster_path": "/k8QLDHT1v65ONfIrKk3jPV4AlTA.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2013-01-13",
                    "episode_count": 12,
                    "id": 45140,
                    "name": "Season 3",
                    "overview": "Season three finds each member of the Gallagher family seeking their individual version of the “American Dream.” Jimmy has moved into the Gallagher home, and Fiona is beginning to realize that a long-term relationship isn’t nearly as fulfilling as she expected… and her GED will only get her so far. Meanwhile, Frank reappears south of the border, with no idea how he got there.",
                    "poster_path": "/ipeHq0WHa3B89xBY4UqzMO4aBNM.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2014-01-12",
                    "episode_count": 12,
                    "id": 45141,
                    "name": "Season 4",
                    "overview": "The crazy Gallaghers returned. They have new issues. Lip went to college. Fiona’s life is gradually improving. She has a stable job. The whole family is waiting for news about the health of Frank. Can the Gallaghers finally realize the middle class American dream? This ain’t no tea party.",
                    "poster_path": "/h61CczBVTmX10MFu1ui2FDEvwUa.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2015-01-11",
                    "episode_count": 12,
                    "id": 63466,
                    "name": "Season 5",
                    "overview": "Season five finds the Gallaghers dealing with both the upside and downside of personal and urban renewal. As their neighborhood begins a move towards gentrifying, the Gallagher clan begins to reconcile their chaotic past in the hopes of building a better future.",
                    "poster_path": "/uOgId3aASp9B6T6Ucuw2IwS5eYW.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2016-01-10",
                    "episode_count": 12,
                    "id": 70404,
                    "name": "Season 6",
                    "overview": "Season six picks up a few months after last season’s finale, as the Gallaghers prepare for yet another long Chicago winter. Frank is still mourning his big loss, while his newfound appreciation for life is freaking the Gallaghers out. This season sees more than just the arctic Lake Michigan winds whipping through the Southside. Carl’s out of juvie. While Fiona struggles with a still-unstable Ian to take his meds, she’s also got another situation looming as Debbie faces a brand new baby-mama-drama.",
                    "poster_path": "/AnYPLrl7Dxx8uXoLhsmEGPD38Fp.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2016-10-02",
                    "episode_count": 12,
                    "id": 77841,
                    "name": "Season 7",
                    "overview": "The Gallaghers have always scraped by, but season seven finds some of them finally getting a leg up, with more changes than the Chicago River. When Frank awakens from a coma to learn that his loved ones tossed him in the river, he declares war - Gallagher vs. Gallagher. But Fiona is too busy improving her own life to worry about Frank’s. Gallagher Golden Boy Lip finishes up his time in rehab, and emerges with a new outlook on alcoholism and his future, whereas the once-unstable Ian is now thriving as an EMT and in a comfortable relationship. Debbie is still figuring out how to be a good mom to young Franny, while Carl has some big decisions to face as he enters manhood.",
                    "poster_path": "/8x0JX3E5LjA8Atzz359UObWaB9Z.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2017-11-05",
                    "episode_count": 12,
                    "id": 91214,
                    "name": "Season 8",
                    "overview": "In season 8 the Gallaghers are finally on an upswing! Frank tries to become a contributing member of society, Fiona finds success as a landlord, Lip struggles to stay sober, Ian takes up a cause, and Debbie tries life as a working single mom.",
                    "poster_path": "/bi6yEMjUFJouqk75ykAiCVNFSKo.jpg",
                    "season_number": 8
                },
                {
                    "air_date": "2018-09-09",
                    "episode_count": 14,
                    "id": 104861,
                    "name": "Season 9",
                    "overview": "In season 9, political fervor hits the South Side, and the Gallaghers take justice into their own hands. Frank sees financial opportunity in campaigning and Fiona tries to build on the success of her apartment building.",
                    "poster_path": "/f322ygNiP6bMGu5oo9G5wieHaV2.jpg",
                    "season_number": 9
                },
                {
                    "air_date": "2019-11-10",
                    "episode_count": 12,
                    "id": 128829,
                    "name": "Season 10",
                    "overview": "Season ten picks up six months after last season’s finale: Frank uses his leg injury to collect as many prescription drugs as possible and his exploits lead him to an old friend. Debbie rules over the Gallagher household with an iron fist. Lip navigates his relationship with Tami. And Gallavich returns as Ian and Mickey rekindle their relationship in prison as both cellmates and lovers.",
                    "poster_path": "/jNMceYdwAasW8jybOtsRNzJcR2r.jpg",
                    "season_number": 10
                },
                {
                    "air_date": "2020-12-06",
                    "episode_count": 12,
                    "id": 142132,
                    "name": "Season 11",
                    "overview": "As Frank confronts his own mortality and family ties in his alcoholic and drug induced twilight years, Lip struggles with the prospect of becoming the family’s new patriarch. Newlyweds Ian and Mickey are figuring out the rules and responsibilities of being in a committed relationship while Deb embraces her individuality and single motherhood. Carl finds an unlikely new career in law enforcement and Kevin and V struggle to decide whether a hard life on the South Side is worth fighting for.",
                    "poster_path": "/9akij7PqZ1g6zl42DQQTtL9CTSb.jpg",
                    "season_number": 11
                }
            ],
            "genres": [
                "Comedy",
                "Drama"
            ],
            "poster": "/9akij7PqZ1g6zl42DQQTtL9CTSb.jpg"
        },
        {
            "creator": "Joe Penhall",
            "title": "Mindhunter",
            "nos": 2,
            "year": "2017-2019",
            "rating": "TV-MA",
            "imdb": "8.6",
            "rt": 0,
            "awards": "Nominated for 2 Primetime Emmys. 4 wins & 32 nominations total",
            "desc": "Set in the late 1970s, two FBI agents are tasked with interviewing serial killers to solve open cases.",
            "stars": "Jonathan Groff, Holt McCallany, Anna Torv",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2017-10-13",
                    "episode_count": 10,
                    "id": 79990,
                    "name": "Season 1",
                    "overview": "",
                    "poster_path": "/su62g54SH6nmDLimJ2EDptHf6m6.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2019-08-16",
                    "episode_count": 9,
                    "id": 127554,
                    "name": "Season 2",
                    "overview": "",
                    "poster_path": "/hOO7LBgN7AKJuV3LbLuIKrtHtnZ.jpg",
                    "season_number": 2
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Thriller"
            ],
            "poster": "/fbKE87mojpIETWepSbD5Qt741fp.jpg"
        },
        {
            "creator": "Drew Goddard",
            "title": "Daredevil",
            "nos": 3,
            "year": "2015-2018",
            "rating": "TV-MA",
            "imdb": "8.6",
            "rt": 0,
            "awards": "Nominated for 5 Primetime Emmys. Another 10 wins & 36 nominations.",
            "desc": "A blind lawyer by day, vigilante by night. Matt Murdock fights the crime of New York as Daredevil.",
            "stars": "Charlie Cox, Deborah Ann Woll, Elden Henson, Vincent D'Onofrio",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2015-04-10",
                    "episode_count": 13,
                    "id": 64558,
                    "name": "Season 1",
                    "overview": "Blinded as a young boy, Matt Murdock fights injustice by day as a lawyer and by night as the superhero Daredevil in Hell's Kitchen, New York City.",
                    "poster_path": "/zFmJQzl6bFrdpHhDkxXmboyykqD.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2016-03-18",
                    "episode_count": 13,
                    "id": 74182,
                    "name": "Season 2",
                    "overview": "Dark forces are tearing Hell's Kitchen apart once again, but this time Daredevil may have to choose between the city and his friends.",
                    "poster_path": "/aZZbCpl4d4lPtd9Jo2We2pQu5EX.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2018-10-19",
                    "episode_count": 13,
                    "id": 109592,
                    "name": "Season 3",
                    "overview": "Missing for months, Matt Murdock reemerges a broken man, putting into question his future as both vigilante Daredevil and lawyer Matthew Murdock. But when his archenemy Wilson Fisk is released from prison, Matt must choose between hiding from the world, or embracing his destiny as a hero.",
                    "poster_path": "/zH6sgePlr1XX0jSZypbfQmr70Lf.jpg",
                    "season_number": 3
                }
            ],
            "genres": [
                "Action",
                "Crime",
                "Drama",
                "Fantasy",
                "Sci-Fi",
                "Thriller"
            ],
            "poster": "/QWbPaDxiB6LW2LjASknzYBvjMj.jpg"
        },
        {
            "creator": "James Manos, Jr.",
            "title": "Dexter",
            "nos": 8,
            "year": "2006-2021",
            "rating": "TV-MA",
            "imdb": "8.6",
            "rt": 0,
            "awards": "Won 4 Primetime Emmys. 53 wins & 196 nominations total",
            "desc": "By day, mild-mannered Dexter is a blood-spatter analyst for the Miami police. But at night, he is a serial killer who only targets other murderers.",
            "stars": "Michael C. Hall, Jennifer Carpenter, David Zayas",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2009-10-25",
                    "episode_count": 29,
                    "id": 59533,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/Ast1fRXfgqMPskoKVEQYPlCNA3w.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2006-10-01",
                    "episode_count": 12,
                    "id": 59499,
                    "name": "Season 1",
                    "overview": "By day, mild-mannered Dexter is a blood-spatter analyst for the Miami police. But at night, he is a serial killer who only targets other murderers.",
                    "poster_path": "/n2YLt7ZRutoaXPWZuGVS7wCqYi4.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2007-09-30",
                    "episode_count": 12,
                    "id": 59500,
                    "name": "Season 2",
                    "overview": "In the season, the bodies of Dexter's victims are uncovered and an investigation is launched in Dexter's own department to find the killer, dubbed the \"Bay Harbor Butcher\". During this time, Debra struggles to recover after surviving the Ice Truck Killer's attempts to murder her, and Rita sends Dexter to Narcotics Anonymous meetings when she suspects that he has an addiction. Sergeant James Doakes, stalks Dexter, suspecting that he is connected with the \"Ice Truck Killer\" killings.",
                    "poster_path": "/hofRzAq3KixpwTf6WiTMBDK2e6Y.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2008-09-28",
                    "episode_count": 12,
                    "id": 59502,
                    "name": "Season 3",
                    "overview": "Dexter kills a man in self-defense and initiates a friendship with the man's brother, Assistant District Attorney Miguel Prado. In the meantime, Rita discovers that she is pregnant, and Debra investigates the murders of a new serial killer, called \"The Skinner\", hoping to gain a promotion to detective.",
                    "poster_path": "/hD1RNFbJWgZaxh3kD8sAL5tkktv.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2009-09-27",
                    "episode_count": 12,
                    "id": 59504,
                    "name": "Season 4",
                    "overview": "Dexter as a father and husband struggles to figure out how to survive for years to come. He seeks to learn from Arthur Mitchell, a serial killer and family man, who has murdered for over thirty years without being discovered.",
                    "poster_path": "/8bTyOkWqU27AoNsTixzu8iuICMN.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2010-09-26",
                    "episode_count": 12,
                    "id": 59506,
                    "name": "Season 5",
                    "overview": "In season five, Dexter comes to terms with the aftermath of the Season 4 finale, stopping a group of serial rapists and avoiding a corrupt cop who learns his deadly secret.",
                    "poster_path": "/rQmftoc0GbPGw7pHao2e1RqB7vz.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2011-10-02",
                    "episode_count": 12,
                    "id": 59509,
                    "name": "Season 6",
                    "overview": "Season six follows Dexter's and Miami Metro's investigations into a string of bizarre ritualistic killings featuring overtly religious apocalyptic symbolism.",
                    "poster_path": "/hfOWFcCYYFgirEpoagsnXeTbCJ3.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2012-09-30",
                    "episode_count": 12,
                    "id": 59510,
                    "name": "Season 7",
                    "overview": "Season seven follows Dexter's tangles with a Ukrainian mob boss and introduces Hannah McKay, a mysterious widow with a green thumb and a checkered past.",
                    "poster_path": "/uS1q8zqGaOVtEoldklXYjPOztz.jpg",
                    "season_number": 7
                },
                {
                    "air_date": "2013-06-30",
                    "episode_count": 12,
                    "id": 59512,
                    "name": "Season 8",
                    "overview": "As Deb struggles to deal with the consequences of her actions, a mysterious woman comes to work with Miami Metro, offering first-hand information on Dexter's past.",
                    "poster_path": "/veDEAb7pXaSNvvPXhwa1PiFlca9.jpg",
                    "season_number": 8
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Mystery"
            ],
            "poster": "/58H6Ctze1nnpS0s9vPmAAzPcipR.jpg"
        },
        {
            "creator": "Peter Morgan",
            "title": "The Crown",
            "nos": 5,
            "year": "2016-",
            "rating": "TV-MA",
            "imdb": "8.6",
            "rt": 0,
            "awards": "Won 10 Primetime Emmys. 92 wins & 236 nominations total",
            "desc": "Follows the political rivalries and romance of Queen Elizabeth II's reign and the events that shaped the second half of the twentieth century.",
            "stars": "Claire Foy, Olivia Colman, Imelda Staunton",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2017-12-08",
                    "episode_count": 3,
                    "id": 198299,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 0
                },
                {
                    "air_date": "2016-11-04",
                    "episode_count": 10,
                    "id": 74331,
                    "name": "Season 1",
                    "overview": "As a young Elizabeth becomes Queen, she must manage major political issues and personal matters, which often clash in ways she never imagined.",
                    "poster_path": "/6TKuHmdHdeeZkLdYxsIV099N8I6.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2017-12-08",
                    "episode_count": 10,
                    "id": 85133,
                    "name": "Season 2",
                    "overview": "As a new era begins, Queen Elizabeth struggles to navigate a world that's changing around her while preserving both the monarchy and her marriage.",
                    "poster_path": "/mYXmtAqu6l2OGxk5xzCyXFvFhfz.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2019-11-17",
                    "episode_count": 10,
                    "id": 108815,
                    "name": "Season 3",
                    "overview": "As the 1960s and '70s unfold, the royal family contends with conflict and betrayal while striving to uphold tradition in the face of an evolving world.",
                    "poster_path": "/sgUNbsq2zGRpFCOPv5yuCR9WAd5.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2020-11-15",
                    "episode_count": 10,
                    "id": 142451,
                    "name": "Season 4",
                    "overview": "As the 1970s are drawing to a close, Queen Elizabeth and her family find themselves preoccupied with safeguarding the line of succession by securing an appropriate bride for Prince Charles, who is still unmarried at 30.",
                    "poster_path": "/7IbBxgYjpOp0i6BT1GRhrQ5EHBt.jpg",
                    "season_number": 4
                },
                {
                    "air_date": null,
                    "episode_count": 0,
                    "id": 198298,
                    "name": "Season 5",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 5
                }
            ],
            "genres": [
                "Biography",
                "Drama",
                "History"
            ],
            "poster": "/7IbBxgYjpOp0i6BT1GRhrQ5EHBt.jpg"
        },
        {
            "creator": "Eric Kripke",
            "title": "The Boys",
            "nos": 2,
            "year": "2019-",
            "rating": "TV-MA",
            "imdb": "8.7",
            "rt": 0,
            "awards": "Nominated for 1 Primetime Emmy. Another 6 wins & 22 nominations.",
            "desc": "A group of vigilantes set out to take down corrupt superheroes who abuse their superpowers.",
            "stars": "Karl Urban, Jack Quaid, Antony Starr, Erin Moriarty",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2020-09-09",
                    "episode_count": 2,
                    "id": 163277,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/cCXG81dSCPXcqYm6gTHlwtXocti.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2019-07-25",
                    "episode_count": 8,
                    "id": 98085,
                    "name": "Season 1",
                    "overview": "",
                    "poster_path": "/g3HjUeFCwKOfBxlM97lv016mnol.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2020-09-04",
                    "episode_count": 8,
                    "id": 154681,
                    "name": "Season 2",
                    "overview": "The even more intense, more insane season two finds The Boys on the run from the law, hunted by the Supes, and desperately trying to regroup and fight back against Vought. In hiding, Hughie, Mother’s Milk, Frenchie and Kimiko try to adjust to a new normal, with Butcher nowhere to be found. Meanwhile, Starlight must navigate her place in The Seven as Homelander sets his sights on taking complete control. His power is threatened with the addition of Stormfront, a social media-savvy new Supe, who has an agenda of her own. On top of that, the Supervillain threat takes center stage and makes waves as Vought seeks to capitalize on the nation’s paranoia.",
                    "poster_path": "/mY7SeH4HFFxW1hiI6cWuwCRKptN.jpg",
                    "season_number": 2
                }
            ],
            "genres": [
                "Action",
                "Comedy",
                "Crime",
                "Sci-Fi"
            ],
            "poster": "/mY7SeH4HFFxW1hiI6cWuwCRKptN.jpg"
        },
        {
            "creator": "John Milius",
            "title": "Rome",
            "nos": 2,
            "year": "2005-2007",
            "rating": "TV-MA",
            "imdb": "8.7",
            "rt": 0,
            "awards": "Won 7 Primetime Emmys. Another 12 wins & 36 nominations.",
            "desc": "A down-to-earth account of the lives of both illustrious and ordinary Romans set in the last days of the Roman Republic.",
            "stars": "Kevin McKidd, Ray Stevenson, Polly Walker, Kerry Condon",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2005-08-11",
                    "episode_count": 1,
                    "id": 5426,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/F4euDCgBCB6WXBYcSkwZCntCCT.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2005-08-28",
                    "episode_count": 12,
                    "id": 5424,
                    "name": "Season 1",
                    "overview": "Season one begins in 52 B.C. as Gaius Julius Caesar completes his quest of Gaul after eight years of war and prepares to return with his army to Rome. But while Caesar's self-interested niece Atia and long-lost paramour Servilia anxiously await his return, the ruling patricians despair that Caesar's homecoming will disrupt the status quo. As Caesar's legions move closer to Rome, allegiances are put to the test for both soldiers and civilians — and the escalating tensions climax with a full-scale conflict destined to change history.",
                    "poster_path": "/iGK1cbNM6gmBLoyWzrcmwG8qazR.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2007-01-14",
                    "episode_count": 10,
                    "id": 5425,
                    "name": "Season 2",
                    "overview": "Season two's storyline picks up right where season one left off: with the 44 B.C. assassination of Gaius Julius Caesar and the near-simultaneous death of Niobe, wife of Caesar's faithful bodyguard Lucius Vorenus. Diverted from his post after learning that Lucius, his assumed grandson, was in fact Niobe's illegitimate son, Vorenus now descends into near-madness over his failure to protect Caesar, his role in his spouse's death, and the rumored murder of his estranged daughters.",
                    "poster_path": "/vvwmV0ZdHNjiJy3bHOb62iv3jPD.jpg",
                    "season_number": 2
                }
            ],
            "genres": [
                "Action",
                "Drama",
                "History",
                "Romance",
                "War"
            ],
            "poster": "/1A1BwgWO3Sw379VEhR0vkTuE3XW.jpg"
        },
        {
            "creator": "Baran bo Odar",
            "title": "Dark",
            "nos": 3,
            "year": "2017-2020",
            "rating": "TV-MA",
            "imdb": "8.8",
            "rt": 0,
            "awards": "7 wins & 21 nominations.",
            "desc": "A family saga with a supernatural twist, set in a German town, where the disappearance of two young children exposes the relationships among four families.",
            "stars": "Louis Hofmann, Karoline Eichhorn, Lisa Vicari, Maja Schöne",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2017-12-11",
                    "episode_count": 4,
                    "id": 101749,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 0
                },
                {
                    "air_date": "2017-12-01",
                    "episode_count": 10,
                    "id": 85712,
                    "name": "Season 1",
                    "overview": "",
                    "poster_path": "/spN6icwSwuAuOcuZLC9bKjK6N2i.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2019-06-21",
                    "episode_count": 8,
                    "id": 124476,
                    "name": "Season 2",
                    "overview": "",
                    "poster_path": "/4IPFQ7gb50dEDXSML7ENtt2TiN5.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2020-06-27",
                    "episode_count": 8,
                    "id": 151853,
                    "name": "Season 3",
                    "overview": "",
                    "poster_path": "/mCekE85ukPTMJ0jN179TvAkCHqY.jpg",
                    "season_number": 3
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Mystery",
                "Sci-Fi",
                "Thriller"
            ],
            "poster": "/nlTUgbZY1E4Dr5B25zLLkudIaV.jpg"
        },
        {
            "creator": "Jonathan Nolan",
            "title": "Westworld",
            "nos": 3,
            "year": "2016-",
            "rating": "TV-MA",
            "imdb": "8.6",
            "rt": 0,
            "awards": "Won 7 Primetime Emmys. Another 44 wins & 192 nominations.",
            "desc": "Set at the intersection of the near future and the reimagined past, explore a world in which every human appetite can be indulged without consequence.",
            "stars": "Thandiwe Newton, Jeffrey Wright, Ed Harris, Evan Rachel Wood",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2018-04-02",
                    "episode_count": 32,
                    "id": 113677,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/qBehWXe1JsPrR2WsoaklThMwg7e.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2016-10-02",
                    "episode_count": 10,
                    "id": 68638,
                    "name": "Season One: The Maze",
                    "overview": "Westworld - a theme park where guests indulge fantasies with robots, a destination offering the future of sin, the artificial intelligence that fuels it and the humans that sense there's something more sinister at play.",
                    "poster_path": "/zKGZJ3Ll3vOHrCk9B0Z0Pr18qnV.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2018-04-22",
                    "episode_count": 10,
                    "id": 98895,
                    "name": "Season Two: The Door",
                    "overview": "The reckoning is here. After finding the center of The Maze, the hosts revolt against their human captors while searching for a new purpose: The Door.",
                    "poster_path": "/1SupbbgG4nDHnmGk37d46u2oT5Z.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2020-03-15",
                    "episode_count": 8,
                    "id": 128116,
                    "name": "Season Three: The New World",
                    "overview": "Taking place immediately after the events of the second season, Dolores develops a relationship with Caleb in neo-Los Angeles, and learns how robots are treated in the real world. Meanwhile, Maeve finds herself in another Delos park, this one with a World War II theme and set in Fascist Italy.",
                    "poster_path": "/mUjK0jqx485OM7hmJiOQ6nHfBD0.jpg",
                    "season_number": 3
                }
            ],
            "genres": [
                "Drama",
                "Mystery",
                "Sci-Fi"
            ],
            "poster": "/y55oBgf6bVMI7sFNXwJDrSIxPQt.jpg"
        },
        {
            "creator": "Scott Frank",
            "title": "The Queen's Gambit",
            "nos": 1,
            "year": "2020",
            "rating": "TV-MA",
            "imdb": "8.6",
            "rt": 0,
            "awards": "29 wins & 10 nominations.",
            "desc": "Orphaned at the tender age of nine, prodigious introvert Beth Harmon discovers and masters the game of chess in 1960s USA. But child stardom comes at a price.",
            "stars": "Anya Taylor-Joy, Chloe Pirrie, Bill Camp, Marcin Dorocinski",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2020-10-23",
                    "episode_count": 7,
                    "id": 120811,
                    "name": "Limited Series",
                    "overview": "",
                    "poster_path": "/zU0htwkhNvBQdVSIKB9s6hgVeFK.jpg",
                    "season_number": 1
                }
            ],
            "genres": [
                "Drama"
            ],
            "poster": "/zU0htwkhNvBQdVSIKB9s6hgVeFK.jpg"
        },
        {
            "creator": "Jon Favreau",
            "title": "The Mandalorian",
            "nos": 2,
            "year": "2019-",
            "rating": "TV-14",
            "imdb": "8.8",
            "rt": 0,
            "awards": "Won 7 Primetime Emmys. 37 wins & 63 nominations total",
            "desc": "The travels of a lone bounty hunter in the outer reaches of the galaxy, far from the authority of the New Republic.",
            "stars": "Pedro Pascal, Gina Carano, Giancarlo Esposito",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2019-11-12",
                    "episode_count": 8,
                    "id": 110346,
                    "name": "Season 1",
                    "overview": "Set after the fall of the Empire and before the emergence of the First Order. We follow the travails of a lone gunfighter in the outer reaches of the galaxy far from the authority of the New Republic.",
                    "poster_path": "/sUTqIb82LxYhPT0SfI8AR03GLpz.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2020-10-30",
                    "episode_count": 8,
                    "id": 153254,
                    "name": "Season 2",
                    "overview": "The Mandalorian and the Child continue their journey, facing enemies and rallying allies as they make their way through a dangerous galaxy in the tumultuous era after the collapse of the Galactic Empire.",
                    "poster_path": "/b8cs9DzhxRQLQ7TvfLihYbAC6fg.jpg",
                    "season_number": 2
                }
            ],
            "genres": [
                "Action",
                "Adventure",
                "Sci-Fi"
            ],
            "poster": "/sWgBv7LV2PRoQgkxwlibdGXKz1S.jpg"
        },
        {
            "creator": "Chris Brancato",
            "title": "Narcos",
            "nos": 3,
            "year": "2015-2017",
            "rating": "TV-MA",
            "imdb": "8.8",
            "rt": 0,
            "awards": "Nominated for 3 Primetime Emmys. 8 wins & 19 nominations total",
            "desc": "A chronicled look at the criminal exploits of Colombian drug lord Pablo Escobar, as well as the many other drug kingpins who plagued the country through the years.",
            "stars": "Pedro Pascal, Wagner Moura, Boyd Holbrook",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2015-08-28",
                    "episode_count": 10,
                    "id": 68934,
                    "name": "Season 1",
                    "overview": "Season one chronicles the rise of drug lord Pablo Escobar, the ruthless boss of the Medellin Cartel and a known terrorist who was also a congressman, a family man and revered by the poor as a new Robin Hood.",
                    "poster_path": "/9lNSJ7l6Dc7aXVrywBlFxhNqXeF.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2016-09-02",
                    "episode_count": 10,
                    "id": 78512,
                    "name": "Season 2",
                    "overview": "Season two continues the story of drug lord Pablo Escobar, the ruthless boss of the Medellin Cartel, including his incarceration in a prison he himself builds and his subsequent fall from power.",
                    "poster_path": "/fshLrkdP1JaRphpN69EMzCsfqg9.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2017-09-01",
                    "episode_count": 10,
                    "id": 89967,
                    "name": "Season 3",
                    "overview": "Season three shifts its focus to Pablo Escobar’s real-life successors in the drug trade: Colombia’s Cali Cartel, \"the biggest drug lords you’ve probably never heard of.\"",
                    "poster_path": "/phoLqMMhtzqyThMNSodTJp2DZMz.jpg",
                    "season_number": 3
                }
            ],
            "genres": [
                "Biography",
                "Crime",
                "Drama"
            ],
            "poster": "/rTmal9fDbwh5F0waol2hq35U4ah.jpg"
        },
        {
            "creator": "Beau Willimon",
            "title": "House of Cards",
            "nos": 6,
            "year": "2013-2018",
            "rating": "TV-MA",
            "imdb": "8.7",
            "rt": 0,
            "awards": "Won 7 Primetime Emmys. 34 wins & 215 nominations total",
            "desc": "A Congressman works with his equally conniving wife to exact revenge on the people who betrayed him.",
            "stars": "Kevin Spacey, Michel Gill, Robin Wright",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": null,
                    "episode_count": 5,
                    "id": 142396,
                    "name": "Specials",
                    "overview": "Additional extras for the House of Cards series.",
                    "poster_path": "/dytK3Hd5360Uzf7LzRAIWcACx8f.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2013-02-01",
                    "episode_count": 13,
                    "id": 3768,
                    "name": "Season 1",
                    "overview": "Betrayed by the White House, Congressman Francis Underwood embarks on a ruthless rise to power. Blackmail, seduction and ambition are his weapons.",
                    "poster_path": "/oUfT2AbMVCYbVA3GIBbPqA6ZpUC.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2014-02-14",
                    "episode_count": 13,
                    "id": 3767,
                    "name": "Season 2",
                    "overview": "In their ruthless rise to power, Francis and Claire battle threats past and present, and form new alliances while old ones succumb to betrayal.",
                    "poster_path": "/e5WNFWA1ZLnHxpr9xQdZMhEpvNo.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2015-02-27",
                    "episode_count": 13,
                    "id": 63599,
                    "name": "Season 3",
                    "overview": "President Underwood fights to secure his legacy. Claire wants more than being First Lady. The biggest threat they face is contending with each other.",
                    "poster_path": "/za2XGEr1BWAuZkI0veLEwVxy30S.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2016-03-04",
                    "episode_count": 13,
                    "id": 72724,
                    "name": "Season 4",
                    "overview": "They've always been a great team. But now in season four, Frank and Claire become even greater adversaries as their marriage stumbles and their ambitions are at odds. In an election year, the stakes are now higher than ever, and the biggest threat they face is contending with each other.",
                    "poster_path": "/1GeYr0qAYpxIGiIabzu1WqzKgtQ.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2017-05-30",
                    "episode_count": 13,
                    "id": 84188,
                    "name": "Season 5",
                    "overview": "Season five picks up where season four left off: in the midst of a tense presidential election that puts the Underwoods on the same ticket against energetic Republican upstart Will Conway. Viewers will see how their heated campaigns play out as well as which alliances dissolve in the aftermath. Perhaps the biggest question is if Frank and Claire’s relationship is among them.",
                    "poster_path": "/xaYAGAQwpsYhLdX9JKTaGI2zgCE.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2018-11-02",
                    "episode_count": 8,
                    "id": 99023,
                    "name": "Season 6",
                    "overview": "With Frank out of the picture, Claire Underwood steps fully into her own as the first woman president, but faces formidable threats to her legacy.",
                    "poster_path": "/AuXh9yFdtppv7GpoisnDnPkBjKU.jpg",
                    "season_number": 6
                }
            ],
            "genres": [
                "Drama"
            ],
            "poster": "/hKWxWjFwnMvkWQawbhvC0Y7ygQ8.jpg"
        },
        {
            "creator": "Nic Pizzolatto",
            "title": "True Detective",
            "nos": 3,
            "year": "2014-2019",
            "rating": "TV-MA",
            "imdb": "8.9",
            "rt": 0,
            "awards": "Won 5 Primetime Emmys. Another 25 wins & 90 nominations.",
            "desc": "Seasonal anthology series in which police investigations unearth the personal and professional secrets of those involved, both within and outside the law.",
            "stars": "Matthew McConaughey, Colin Farrell, Mahershala Ali, Woody Harrelson",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2014-01-07",
                    "episode_count": 3,
                    "id": 177275,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 0
                },
                {
                    "air_date": "2014-01-12",
                    "episode_count": 8,
                    "id": 59780,
                    "name": "Season 1",
                    "overview": "In 2012, Louisiana State Police Detectives Rust Cohle and Martin Hart  are brought in to revisit a homicide case they worked in 1995. As the  inquiry unfolds in present day through separate interrogations, the two  former detectives narrate the story of their investigation, reopening  unhealed wounds, and drawing into question their supposed solving of a  bizarre ritualistic murder in 1995. The timelines braid and converge in  2012 as each man is pulled back into a world they believed they'd left  behind. In learning about each other and their killer, it becomes clear  that darkness lives on both sides of the law.",
                    "poster_path": "/bppxcPh60DftSkKkj5wdmSua5sd.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2015-06-21",
                    "episode_count": 8,
                    "id": 62750,
                    "name": "Season 2",
                    "overview": "A bizarre murder brings together three law-enforcement officers and a career criminal, each of whom must navigate a web of conspiracy and betrayal in the scorched landscapes of California.",
                    "poster_path": "/owTL3WTY4Yax2qClnwbaDsOO72r.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2019-01-13",
                    "episode_count": 8,
                    "id": 98029,
                    "name": "Season 3",
                    "overview": "Season 3 tells the story of a macabre crime involving two missing children in the heart of the Ozarks, a mystery that deepens over decades and plays out in three separate time periods.",
                    "poster_path": "/uOd2yMAxhfvwNd0pkVapHgRk1c1.jpg",
                    "season_number": 3
                }
            ],
            "genres": [
                "Crime",
                "Drama",
                "Mystery",
                "Thriller"
            ],
            "poster": "/aowr4xpLP5sRCL50TkuADomJ98T.jpg"
        },
        {
            "creator": "Michael Dante DiMartino",
            "title": "Avatar: The Last Airbender",
            "nos": 3,
            "year": "2005-",
            "rating": "TV-Y7-FV",
            "imdb": "9.3",
            "rt": 0,
            "awards": "Won 1 Primetime Emmy. Another 8 wins & 6 nominations.",
            "desc": "In a war-torn world of elemental magic, a young boy reawakens to undertake a dangerous mystic quest to fulfill his destiny as the Avatar, and bring peace to the world.",
            "stars": "Dee Bradley Baker, Zach Tyler, Mae Whitman, Jack De Sena",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": null,
                    "episode_count": 22,
                    "id": 788,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/iXwy3xSLTJCzfnA5iMmd4W8MrCK.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2005-02-21",
                    "episode_count": 20,
                    "id": 785,
                    "name": "Book One: Water",
                    "overview": "Katara and Sokka (a brother and sister from the Southern Water Tribe) discover the Avatar (a 12-year-old Airbender boy named Aang) frozen in an iceberg. Together the three begin their journey to the North Pole to find a master Waterbender so Aang can begin his Avatar training!",
                    "poster_path": "/tUG6h0rMtQyOgvqI8r9AqxlKoUP.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2006-03-17",
                    "episode_count": 20,
                    "id": 787,
                    "name": "Book Two: Earth",
                    "overview": "Aang, along with Katara, Sokka, and their animal friends Appa and Momo, continues on his quest to fulfill his destiny as the Avatar. According to the Avatar cycle, the group must now enter the Earth Kingdom to search for a master Earthbender to teach Aang.",
                    "poster_path": "/quX70K1L7vTLQ9vRJcK0kKcNNFA.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2007-09-21",
                    "episode_count": 21,
                    "id": 786,
                    "name": "Book Three: Fire",
                    "overview": "Aang wakes up from his battle with Azula to discover that Ba Sing Se has fallen and the world thinks he's dead. So he and his friends set off undercover across the Fire Nation to find Firelord Ozai before the Day of Black Sun. Prince Zuko returns home as the triumphant son, but soon finds the honor he so greatly craved from his father is worthless. New alliances are formed and Team Avatar forges a new plan to stop the Firelord. But will they find him in time?",
                    "poster_path": "/roPE4jaHawj1Dm6uIXJHuLDpkNy.jpg",
                    "season_number": 3
                }
            ],
            "genres": [
                "Animation",
                "Action",
                "Adventure",
                "Family",
                "Fantasy",
                "Mystery"
            ],
            "poster": "/cHFZA8Tlv03nKTGXhLOYOLtqoSm.jpg"
        },
        {
            "creator": "Dan Harmon",
            "title": "Rick and Morty",
            "nos": 5,
            "year": "2013-",
            "rating": "TV-MA",
            "imdb": "9.2",
            "rt": 0,
            "awards": "Won 2 Primetime Emmys. Another 16 wins & 25 nominations.",
            "desc": "An animated series that follows the exploits of a super scientist and his not-so-bright grandson.",
            "stars": "Justin Roiland, Chris Parnell, Spencer Grammer, Sarah Chalke",
            "nextepi": {
                "air_date": "2021-06-27",
                "episode_number": 2,
                "id": 2991268,
                "name": "Mortyplicity",
                "overview": "Who's even real, broh? Are you real? Broh?",
                "production_code": "",
                "season_number": 5,
                "still_path": null,
                "vote_average": 0.0,
                "vote_count": 0
            },
            "seasons": [
                {
                    "air_date": "2016-10-26",
                    "episode_count": 21,
                    "id": 106178,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 0
                },
                {
                    "air_date": "2013-12-02",
                    "episode_count": 11,
                    "id": 60059,
                    "name": "Season 1",
                    "overview": "Rick and Morty visit a pawn shop in space, encounter various alternate and virtual realities, and meet the devil at his antique shop.",
                    "poster_path": "/pZoqbuJGaVM7vgzsSCPwRH5TCx5.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2015-07-26",
                    "episode_count": 10,
                    "id": 66738,
                    "name": "Season 2",
                    "overview": "After Rick and Morty decided to unfreeze time, they must deal with alien parasites, alternate Jerrys and a decaying, possibly non-existent dimension.",
                    "poster_path": "/zkhGdE29umuKwa6u6mm7e4cXvYY.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2017-04-01",
                    "episode_count": 10,
                    "id": 86926,
                    "name": "Season 3",
                    "overview": "Rick and Morty travel to Atlantis and take some time to relax, plus Rick turns himself into a pickle and faces off against the president.",
                    "poster_path": "/lVcwMfbHx4QguLbZT4bink9mcgd.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2019-11-10",
                    "episode_count": 10,
                    "id": 128112,
                    "name": "Season 4",
                    "overview": "",
                    "poster_path": "/ylL3eViYKBhtjaqVe4pLMslVBjR.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2021-06-20",
                    "episode_count": 10,
                    "id": 188470,
                    "name": "Season 5",
                    "overview": "",
                    "poster_path": "/wwNZjZuBZy2oF5ovPiwAzNOmO3l.jpg",
                    "season_number": 5
                }
            ],
            "genres": [
                "Animation",
                "Adventure",
                "Comedy",
                "Sci-Fi"
            ],
            "poster": "/8kOWDBK6XlPUzckuHDo3wwVRFwt.jpg"
        },
        {
            "creator": "Chris Brancato",
            "title": "Narcos: Mexico",
            "nos": 3,
            "year": "2018-",
            "rating": "TV-MA",
            "imdb": "8.4",
            "rt": 0,
            "awards": "2 wins & 8 nominations.",
            "desc": "The rise of the Guadalajara Cartel as an American DEA agent learns the danger of targeting narcos in Mexico.",
            "stars": "Scoot McNairy, Diego Luna, José María Yazpik, Fermín Martínez",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2018-11-16",
                    "episode_count": 10,
                    "id": 106584,
                    "name": "Season 1",
                    "overview": "Narcos tells the true-life story of the growth and spread of cocaine drug cartels across the globe and attendant efforts of law enforcement to meet them head on in brutal, bloody conflict. It centers around the notorious Colombian cocaine kingpin Pablo Escobar (Wagner Moura) and Steve Murphy (Holbrook), a DEA agent sent to Colombia on a U.S. mission to capture him and ultimately kill him.",
                    "poster_path": "/genemrRnpl7NauAPMkCgAMerrqN.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2020-02-13",
                    "episode_count": 10,
                    "id": 124641,
                    "name": "Season 2",
                    "overview": "",
                    "poster_path": "/gQQGxVhdBvT2l7G1Zz6JYSCmL6q.jpg",
                    "season_number": 2
                },
                {
                    "air_date": null,
                    "episode_count": 0,
                    "id": 166998,
                    "name": "Season 3",
                    "overview": "",
                    "poster_path": null,
                    "season_number": 3
                }
            ],
            "genres": [
                "Crime",
                "Drama"
            ],
            "poster": "/gQQGxVhdBvT2l7G1Zz6JYSCmL6q.jpg"
        },
        {
            "creator": "Vikramaditya Motwane",
            "title": "Sacred Games",
            "nos": 2,
            "year": "2018-2019",
            "rating": "TV-MA",
            "imdb": "8.6",
            "rt": 0,
            "awards": "5 wins & 11 nominations.",
            "desc": "A link in their pasts leads an honest cop to a fugitive gang boss, whose cryptic warning spurs the officer on a quest to save Mumbai from cataclysm.",
            "stars": "Saif Ali Khan, Nawazuddin Siddiqui, Neeraj Kabi, Elnaaz Norouzi",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2018-07-06",
                    "episode_count": 8,
                    "id": 103461,
                    "name": "Season 1",
                    "overview": "A link in their pasts leads an honest cop to a fugitive gang boss, whose cryptic warning spurs the officer on a quest to save Mumbai from cataclysm.",
                    "poster_path": "/mVQ6JFJCAMRLKvsMZdiEeYXC6cp.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2019-08-15",
                    "episode_count": 8,
                    "id": 109736,
                    "name": "Season 2",
                    "overview": "As Mumbai’s fate hangs in the balance, Sartaj Singh chases a connection to Ganesh Gaitonde’s third father, an enigmatic guru with a catastrophic plan.",
                    "poster_path": "/5Bs2SBg97gaqoYH2c9zRNOEctaz.jpg",
                    "season_number": 2
                }
            ],
            "genres": [
                "Action",
                "Crime",
                "Drama",
                "Thriller"
            ],
            "poster": "/uEbNtFbK4At9WBDGap23lt1qO9n.jpg"
        },
        {
            "creator": "Karan Anshuman",
            "title": "Mirzapur",
            "nos": 2,
            "year": "2018-",
            "rating": "TV-MA",
            "imdb": "8.4",
            "rt": 0,
            "awards": "3 nominations",
            "desc": "A shocking incident at a wedding procession ignites a series of events entangling the lives of two families in the lawless city of Mirzapur.",
            "stars": "Pankaj Tripathi, Ali Fazal, Divyendu Sharma",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2018-11-15",
                    "episode_count": 9,
                    "id": 112728,
                    "name": "Season 1",
                    "overview": "",
                    "poster_path": "/7ix8lfyJWL9H14NmRovMFoaN02u.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2020-10-23",
                    "episode_count": 10,
                    "id": 127240,
                    "name": "Season 2",
                    "overview": "",
                    "poster_path": "/micAwB7cJys2ObpRYio6QdAWCIv.jpg",
                    "season_number": 2
                }
            ],
            "genres": [
                "Action",
                "Crime",
                "Drama"
            ],
            "poster": "/yuwE4sI4HxzAI4Sq2i1ja36kwCT.jpg"
        },
        {
            "creator": "Álex Pina",
            "title": "Money Heist: The Phenomenon",
            "nos": 2,
            "year": "2020",
            "rating": "TV-14",
            "imdb": "7.5",
            "rt": 0,
            "awards": "N/A",
            "desc": "A documentary on why and how \"Money Heist\" sparked a wave of enthusiasm around the world for a lovable group of thieves and their professor.",
            "stars": "N/A",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2017-12-20",
                    "episode_count": 22,
                    "id": 150472,
                    "name": "Specials",
                    "overview": "",
                    "poster_path": "/57NLY74OAQHUv2Lv35YEK4joFme.jpg",
                    "season_number": 0
                },
                {
                    "air_date": "2017-05-02",
                    "episode_count": 15,
                    "id": 87809,
                    "name": "Season 1",
                    "overview": "Under the guidance of The Professor, a group of eight very peculiar robbers have attacked the National Coinage and Stamp Factory of Spain and took hostages to carry out the most perfect robbery in the history, aiming to take home 2.4 billion Euros in cash.",
                    "poster_path": "/jAGeeCuAh4Id4p78BOYsSFXLrC8.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2019-07-19",
                    "episode_count": 16,
                    "id": 122186,
                    "name": "Season 2",
                    "overview": "The Professor and his team reunite to free Rio, this time targeting the Bank of Spain with a daring and dangerous new plan. The Resistance continues.",
                    "poster_path": "/bp2MEZT8dsl33ULA8RA1IK6ZbZ.jpg",
                    "season_number": 2
                }
            ],
            "genres": [
                "Documentary"
            ],
            "poster": "/MoEKaPFHABtA1xKoOteirGaHl1.jpg"
        },
        {
            "creator": "Jason Rothenberg",
            "title": "The 100",
            "nos": 7,
            "year": "2014-2020",
            "rating": "TV-14",
            "imdb": "7.6",
            "rt": 0,
            "awards": "Nominated for 1 Primetime Emmy. 9 wins & 46 nominations total",
            "desc": "Set ninety-seven years after a nuclear war has destroyed civilization, when a spaceship housing humanity's lone survivors sends one hundred juvenile delinquents back to Earth, in hopes of possibly re-populating the planet.",
            "stars": "Eliza Taylor, Bob Morley, Marie Avgeropoulos",
            "nextepi": null,
            "seasons": [
                {
                    "air_date": "2014-03-19",
                    "episode_count": 13,
                    "id": 55214,
                    "name": "Season 1",
                    "overview": "Set 97 years after a nuclear war has destroyed civilization, when a spaceship housing humanity's lone survivors sends 100 juvenile delinquents back to Earth in hopes of possibly re-populating the planet.",
                    "poster_path": "/jAsSkxSGEjeEEHL3KiWXr3NwyPG.jpg",
                    "season_number": 1
                },
                {
                    "air_date": "2014-10-22",
                    "episode_count": 16,
                    "id": 62026,
                    "name": "Season 2",
                    "overview": "The second season picks up with the group still scattered and desperate to be reunited. As members of The 100 and new arrivals from the Ark stake out their place in a dangerous and beautiful new world, they are confronted with the physical peril and moral dilemmas that come with reforging a society.",
                    "poster_path": "/4ngujsHppz4Imxh7qf9NQIIMlLY.jpg",
                    "season_number": 2
                },
                {
                    "air_date": "2016-01-21",
                    "episode_count": 16,
                    "id": 72595,
                    "name": "Season 3",
                    "overview": "Reunited with the survivors of the space-station Ark that fell to Earth, Clarke Griffin and her band of juvenile delinquents have faced death at every turn. Though Clarke was alternately challenged, supported and betrayed by her own people and alliances with the Grounders, they could always find common ground in survival. But victory came with a terrible price. The challenges continue in season three as they not only determine what kind of lives they will build, but what it will ultimately cost them.",
                    "poster_path": "/ayebqASxTXVSo9Qoug6M5YowZS0.jpg",
                    "season_number": 3
                },
                {
                    "air_date": "2017-02-01",
                    "episode_count": 13,
                    "id": 82960,
                    "name": "Season 4",
                    "overview": "The fight to survive has torn The 100 apart, turned them against each other, and taken the lives of their closest friends. Last season, our heroes found themselves at the epicenter of both the Grounder world and the struggle for Arkadia’s soul. Despite their best efforts, war appeared unavoidable, until a new, even more dangerous threat - one that had been quietly rising all along - exploded to the surface: ALIE, the A.I. that ended the world, offered relief from pain and eternal life in the “City of Light.” But as her ranks grew, it quickly became clear that she was building an army dedicated to controlling all sentient life on Earth. This was no longer a battle between warring factions; it was a fight for humanity itself. Now, a hard truth lands on the shoulders of those who remain. Will they go quietly into the night, or will they find hope and faith in each other, as they face their darkest chapter yet?",
                    "poster_path": "/qCdJvikZUQkr4sOVYNkKHntRfha.jpg",
                    "season_number": 4
                },
                {
                    "air_date": "2018-04-24",
                    "episode_count": 13,
                    "id": 90748,
                    "name": "Season 5",
                    "overview": "More than six years have passed since Praimfaya has ravaged the planet and killed most of the human race. As Clarke waits to hear from the group on the Ark, or in the bunker, a prison ship drops from the sky. Are they friend or foe? And what do they want?",
                    "poster_path": "/6uuX26IfMQeh3ARStMdToubrFEo.jpg",
                    "season_number": 5
                },
                {
                    "air_date": "2019-04-30",
                    "episode_count": 13,
                    "id": 116111,
                    "name": "Season 6",
                    "overview": "After 125 years in cryosleep, traveling through the stars, our heroes woke up to a new home, a final gift from dearly-departed friends. A place where they can try again. They’re given one simple task: do better. Be the good guys. With this credo in mind Clarke and Bellamy lead a group down to this mysterious world, hoping to start anew, to finally find peace. But old habits die hard and when they stumble across an idyllic society, it quickly becomes clear that not everything on Sanctum is as perfect as it seems. Despite their determination to do better, threats both seen and unseen will once again force our heroes to fight for their lives and the future of humanity.",
                    "poster_path": "/wBzNjurA8ijJPF21Ggs9nbviIzi.jpg",
                    "season_number": 6
                },
                {
                    "air_date": "2020-05-19",
                    "episode_count": 16,
                    "id": 142731,
                    "name": "Season 7",
                    "overview": "After arriving on a new planet, our heroes found a place where they hoped to try again. Clarke and Bellamy led a group down to this mysterious world to start anew, but not everything on Sanctum was as perfect as it seemed. Despite their determination to do better, threats both seen and unseen once again forced them to fight for their lives and the future of humanity.",
                    "poster_path": "/9OfbNi3mzyn0rd0vnCP8gj4szW0.jpg",
                    "season_number": 7
                }
            ],
            "genres": [
                "Drama",
                "Mystery",
                "Sci-Fi"
            ],
            "poster": "/wcaDIAG1QdXQLRaj4vC1EFdBT2.jpg"
        }
    ]
}